{
  "resume": "It is a web page created with HTML5, CSS3, JS and PHP. a responsive website with a comfortable design to facilitate the user experience and high performance. Created to make it easier for Venezuelan schools to register for the Recreational Mathematics Olympics.",
  "dsc": "Web page for the administration of the Recreational Mathematics Olympics of Venezuela",
  "role": "Fullstack",
  "intro": "The Recreational Mathematics Olympics of Venezuela is an event with the objective of developing strategies for the teaching of Mathematics, improve the academic level and stimulate in children the use of their intellectual capacities: comprehension, synthesis capacity and critical judgment.",
  "intro2": "In the Recreational Mathematics Olympics, a lot of schools enroll which enroll a lot of students, the main objective of the website is to allow schools to register and manage their participants, it also allows the organizers of the Olympics can have an optimal administration of all the information of the event, such as data from schools, students and exams.",
  "cmstitle": "CMS",
  "cmsintro": "To manage the information of the schools, students and exams, a Content Management System was developed in order that the information can be viewed, created, edited or deleted. It also has a privilege system so that there are various roles within That is, to perform various actions you must have privileges to do so. It has an auditing system in which the actions that have been carried out within the CMS are monitored. In addition, it has data export to Excel that are necessary, be it a list of students, schools or exams. It even allows manual corrections to be made to exams that were in person in case the system has not been able to identify which participant it belongs to.",
  "examtitle": "EXAMS",
  "examdsc": "The Recreational Mathematics Olympiad of Venezuela has three tests that are developed in phases. The tests vary depending on the grade in which the student is. Each of these tests has a unique structure, scoring system and difficulty:",
  "exampre": "Preliminary Test: This test is carried out prior to the regional tests, where only simple selection questions are made which are configured from the CMS, placing the correct answer, the score, area and difficulty. Furthermore, these tests are calculated automatically. An operator can make manual corrections in case the system does not find the student who took an exam (Physical). As well, they can make edits to the answers, as long as they have the corresponding privileges.",
  "examRegional": "Regional Test: This test is carried out by students who passed the preliminary test. The test has a system to do it online, and it can also be done in person. The questions in this exam are compound. They can be of simple selection, explanation of answers and you can even attach images to the answers in case you do it online. The correction of the answers are made by teachers assigned from the CMS. Where they place the score and an observation of the student's response and explanation of the score. Exam corrections are anonymous, this means that teachers do not know whose test they are correcting is.",
  "examNational": "National Test: This test is presented by students who passed the regional test. As the Regional can be done online or in person, the questions are similar to those of the regional test as well as their correction by the teachers. Although, their scoring system is different.",
  "feature1title": "Responsive Web Design",
  "feature1": "The website can be viewed on any device and continue to behave efficiently on mobile devices.",
  "feature3title": "Use of SVG's",
  "feature3": "For the images within the web page, SVGs were used to improve loading times, as well as various elements were made with pure CSS.",
  "feature4title": "Exportation to Excel",
  "feature4": "Both the website and the CMS allow data to be exported to Excel, in the case of the website, schools can export lists with their participants, just as in the CMS the answers of the exams can be exported.",
  "feature5title": "Reduced HTTP requests",
  "feature5": "Requests to the server are reduced to improve loading times in cases of long information lists such as participant lists.",
  "feature6title": "Big exports with Zip",
  "feature6": "In the case of downloading a large amount of information, such as the list of participants in total, these can be more than 10,000, to improve the download times of the packages.",
  "project": {
    "role": "Role:",
    "agency": "Agency:",
    "date": "Date:",
    "introTitle": "Introduction",
    "visualRes": "Visual Result",
    "typoColor": "Typography - Color",
    "features": "Features",
    "thanks": "Thanks for Watching!",
    "hereMore": "Here you can know more ",
    "aboutLink": "about me",
    "otherWork": "You can see my other works!",
    "visitProject": "Visit"
  }
}
