{
  "header": {
    "aboutButton": "ABOUT ME"
  },
  "home": {
    "presentation": "Hello! My name is Samuel Rojas.",
    "description": "I'm a web and mobile developer that build responsive websites and development cross-platform Apps.",
    "linkProject": "View Project"
  },
  "myWeb": {
    "resume": "A website that is a Single-page application(SPA). With a high-performance, responsive website that uses powered animations. As also, uses the creative SVG's power for enriching user experience.",
    "dsc": "My own website where I show the things what I do",
    "agency": "Own project",
    "role": "Owner/Dev",
    "intro": "The design of my portfolio was made by myself, from the beginning I wanted it to be a website in dark mode, since I am not a fan of light mode. Also, that it will have simple animations so as not to saturate the user experience.",
    "intro2": "During development, details that were not at the initial point were added to make a more fluid experience. A website that takes advantage of the use of SVGs for better rendering and easy navigation for a better flow on the web page.",
    "feature1title": "Responsive Web Design",
    "feature1": "The design of the page is scalable to mobile devices and any resolution, behaving efficiently on any device and allowing any user to enjoy the web page.",
    "feature2title": "Use of SVG's",
    "feature2": "The website has SVG images to improve loading times and make downloading more efficient. Also, so that the quality of the images is the same on any screen.",
    "feature3title": "Simple Animations",
    "feature3": "Every detail of the page has a simple animation so as not to overload the site with animations. That is why it has simple fade-out, fade-in and slide style animations.",
    "feature4title": "Interactive transition",
    "feature4": "For navigation between screens, a simple transition was created for a better experience when navigating between screens. Also, when browsing you can determine where you are by the shape of the hamburger-menu.",
    "feature5title": "Friendly Website",
    "feature5": "The color palette is pretty straightforward, as the main theme is dark mode. It has simple colors and simple elements to make it a friendly site.",
    "feature6title": "About Page",
    "feature6": "To show the social networks, I decided to place a footer in which they could be viewed in a better way, just as when you see more about me, you can find my social networks.",
    "feature7title": "Custom Design for Each Project",
    "feature7": "Each page of a project has personalized elements so that the details of the projects can be better appreciated."
  },
  "orm": {
    "resume": "It is a web page created with HTML5, CSS3, JS and PHP. a responsive website with a comfortable design to facilitate the user experience and high performance. Created to make it easier for Venezuelan schools to register for the Recreational Mathematics Olympics.",
    "dsc": "Web page for the administration of the Recreational Mathematics Olympics of Venezuela",
    "role": "Frontend/Backend",
    "intro": "The Recreational Mathematics Olympics of Venezuela is an event with the objective of developing strategies for the teaching of Mathematics, improve the academic level and stimulate in children the use of their intellectual capacities: comprehension, synthesis capacity and critical judgment.",
    "intro2": "In the Recreational Mathematics Olympics, a lot of schools enroll which enroll a lot of students, the main objective of the website is to allow schools to register and manage their participants, it also allows the organizers of the Olympics can have an optimal administration of all the information of the event, such as data from schools, students and exams.",
    "feature1title": "Responsive Web Design",
    "feature1": "The website can be viewed on any device and continue to behave efficiently on mobile devices.",
    "feature2title": "CMS",
    "feature2": "To manage the information of the schools, students and exams, a content management system was developed, in order that the information can be viewed, created, edited or deleted. It also has a privilege system so that there are different roles within the administration. Also, this allows manual corrections of the exams in case the system has not been able to identify which participant it belongs to.",
    "feature3title": "Use of SVG's",
    "feature3": "For the images within the web page, SVGs were used to improve loading times, as well as various elements were made with pure CSS.",
    "feature4title": "Exportation to Excel",
    "feature4": "Both the website and the CMS allow data to be exported to Excel, in the case of the website, schools can export lists with their participants, just as in the CMS the answers of the exams can be exported.",
    "feature5title": "Reduced HTTP requests",
    "feature5": "Requests to the server are reduced to improve loading times in cases of long information lists such as participant lists.",
    "feature6title": "Big exports with Zip",
    "feature6": "In the case of downloading a large amount of information, such as the list of participants in total, these can be more than 10,000, to improve the download times of the packages."
  },
  "fjcintranet": {
    "resume": "It is an internal single page system (SPA). Created with Angular 8 and Java Spring, for document and discovery management at the Jacinto Convit Foundation. A website that has international standards and under the ISO 9001 standard.",
    "role": "Manager/Frontend/Backend",
    "cmsresult": "Visual CMS Result",
    "dsc": "Internal system for document management and findings processes",
    "intro": "The Fundación Jacinto Convit (FJC) is a non-profit institution that preserves, protects and continues the work, projects, values ​​and philosophy of the doctor, scientist and humanist Dr. Jacinto Convit.",
    "intro2": "Due to the large number of documents handled by the foundation, the main objective of the internal system that we achieved was to improve the management of large amounts of documents. Also, the foundation having the ISO 9001 license, must meet certain quality criteria, which is why the internal system has the management of these processes both for problem solving and for auditing them. The Fundacion Jacinto Convit has offices in Venezuela and the US, which is why the system was developed in two languages, English and Spanish.",
    "feature1title": "CMS",
    "feature1": "The system has a Content Management System to monitor the internal system, this has the possibility of viewing, creating, editing or deleting any type of information that the entered system has. Having in turn set aside to monitor user activities and limit them.",
    "feature2title": "High Performance",
    "feature2": "The system has great performance thanks to the use of Java Spring Boot, which allows managing cached information to improve loads. Also, its great speed is due to the simplicity of the information that is required for each process.",
    "feature3title": "Document Creation",
    "feature3": "The document management module allows users to create both Word and Excel documents, it also allows to save other types of files that are necessary. Templates can be uploaded from the CMS",
    "feature4title": "Calendar with Alerts",
    "feature4": "The calendar was created to organize activities within the foundation, such as meetings or events, they also allow you to keep track of the tasks that must be done in the findings for their resolution.",
    "feature5title": "Multi-language",
    "feature5": "The system is in both English and Spanish, because the institution has different offices around the world, that is why this information must be contracted in both languages ​​for better use and a better user experience."
  },
  "knowlegde": {
    "firstDsc":"I’m very familiar using web tecnhologies like HTML5, CCS3 and JavaScript. and also I have used frameworks such as Angular and React.",
    "secondDsc":"I have experience using ES6, ES7, ES8, ES9 and TypeScript, also I have experience building responsive websites with a high-performance.",
    "thirdDsc":"Otherwise, I’m familiar using the framework React Native for building across-platform Apps. and Also, Electron in the case of cross-platform desktop applications",
    "quarterDsc":"However, In the back-end I have used PHP and Java, using both SQL and NoSQL databases. Such as MySQL, PostgreSQL, MongoDB, Realm and Firebase."
  },
  "traumapp": {
    "resume": "It is a multiplatform mobile application developed with React Native. It has a comfortable interface for the user and improve its daily use. Created to optimize a medical consultation and the management of patient information."
  },
  "about":{
    "resume":"I'm a Venezuelan web designer and a mobile developer<br>I really like to create useful and intuitive products with comfortable visual interfaces for everybody.",
    "aboutLink":"Read more about me",
    "welcome": "Hello!",
    "intro":"My name is Samuel<br>I am a web designer and mobile developer currently working as freelance programmer, I am in Caracas, Venezuela.",
    "whatILike": "I really like to make useful and intuitive products with comfortable visual interfaces for anyone. I like to analyze the user context in order to create the best solution on each project. I have experience making cross-platform applications and working as front-end developer in some projects. as well, I have builded responsive websites.",
    "tec": "Although I am very familiar with frameworks such as React Native, React and Angular for application development, most of the websites I have developed were coded primarily by hand with HTML5, CCS3, JavaScript and PHP.",
    "keepingUp": "For always keeping me updated, I read books, read updated documentation, watch lectures and watch YouTube videos to learn about new technologies.",
    "contact": "If you have a project, you are interested in a collaboration or just want to say hello, don't hesitate to send me an email to samuel_dear@hotmail.com",
    "spam": "You can also know more about me here:"
  },
  "slideMenu":{
    "homeLink": "HOME",
    "projectsLink": "PROJECTS",
    "knowlegdeLink": "KNOWLEGDE",
    "whoDesigned": "WHO DESIGNED THIS?",
    "aboutLink": "ABOUT ME",
    "studies": "STUDIES"
  },
  "project": {
    "role": "Role:",
    "agency": "Agency:",
    "date": "Date:",
    "introTitle": "Introduction",
    "visualRes": "Visual Result",
    "typoColor": "Typography - Color",
    "features": "Features",
    "thanks": "Thanks for Watching!",
    "hereMore": "Here you can know more ",
    "aboutLink": "about me",
    "otherWork": "You can see my other works!"
  }
}
