{
  "copy": "© 2021, All rights reserved.",
  "header": {
    "aboutButton": "ABOUT ME"
  },
  "home": {
    "presentation": "Hello! My name is Samuel Rojas.",
    "description": "I'm a web and mobile developer that build responsive websites and development cross-platform Apps.",
    "linkProject": "View Project",
    "msgContact": "Feel free to contact me on",
    "submsgContact": "Or you can send me an email from here!",
    "labelName": "Name",
    "labelEmail": "Email",
    "labelDscEmail": "Message",
    "btnText": "Send",
    "requiredInput": "This field is required.",
    "invalidEmail": "Invalid email."
  },
  "myWeb": {
    "resume": "A website that is a Single-page application(SPA). With a high-performance, responsive website that uses powered animations. As also, uses the creative SVG's power for enriching user experience.",
    "dsc": "My own website where I show the things what I do",
    "agency": "Own project",
    "role": "Owner/Dev",
    "intro": "The design of my portfolio was made by myself, from the beginning I wanted it to be a website in dark mode, since I am not a fan of light mode. Also, that it will have simple animations so as not to saturate the user experience.",
    "intro2": "During development, details that were not at the initial point were added to make a more fluid experience. A website that takes advantage of the use of SVGs for better rendering and easy navigation for a better flow on the web page.",
    "feature1title": "Responsive Web Design",
    "feature1": "The design of the page is scalable to mobile devices and any resolution, behaving efficiently on any device and allowing any user to enjoy the web page.",
    "feature2title": "Use of SVG's",
    "feature2": "The website has SVG images to improve loading times and make downloading more efficient. Also, so that the quality of the images is the same on any screen.",
    "feature3title": "Simple Animations",
    "feature3": "Every detail of the page has a simple animation so as not to overload the site with animations. That is why it has simple fade-out, fade-in and slide style animations.",
    "feature4title": "Interactive transition",
    "feature4": "For navigation between screens, a simple transition was created for a better experience when navigating between screens. Also, when browsing you can determine where you are by the shape of the hamburger-menu.",
    "feature5title": "Friendly Website",
    "feature5": "The color palette is pretty straightforward, as the main theme is dark mode. It has simple colors and simple elements to make it a friendly site.",
    "feature6title": "About Page",
    "feature6": "To show the social networks, I decided to place a footer in which they could be viewed in a better way, just as when you see more about me, you can find my social networks.",
    "feature7title": "Custom Design for Each Project",
    "feature7": "Each page of a project has personalized elements so that the details of the projects can be better appreciated.",
    "feature8title": "CI/CD",
    "feature8": "For automatic deployments, GitHub Actions is used to build the project and then the files are transferred via FTP to the server for the deployment of the web page."
  },
  "orm": {
    "resume": "It is a web page created with HTML5, CSS3, JS and PHP. a responsive website with a comfortable design to facilitate the user experience and high performance. Created to make it easier for Venezuelan schools to register for the Recreational Mathematics Olympics.",
    "dsc": "Web page for the administration of the Recreational Mathematics Olympics of Venezuela",
    "role": "Fullstack",
    "intro": "The Recreational Mathematics Olympics of Venezuela is an event with the objective of developing strategies for the teaching of Mathematics, improve the academic level and stimulate in children the use of their intellectual capacities: comprehension, synthesis capacity and critical judgment.",
    "intro2": "In the Recreational Mathematics Olympics, a lot of schools enroll which enroll a lot of students, the main objective of the website is to allow schools to register and manage their participants, it also allows the organizers of the Olympics can have an optimal administration of all the information of the event, such as data from schools, students and exams.",
    "cmstitle": "CMS",
    "cmsintro": "To manage the information of the schools, students and exams, a Content Management System was developed in order that the information can be viewed, created, edited or deleted. It also has a privilege system so that there are various roles within That is, to perform various actions you must have privileges to do so. It has an auditing system in which the actions that have been carried out within the CMS are monitored. In addition, it has data export to Excel that are necessary, be it a list of students, schools or exams. It even allows manual corrections to be made to exams that were in person in case the system has not been able to identify which participant it belongs to.",
    "examtitle": "EXAMS",
    "examdsc": "The Recreational Mathematics Olympiad of Venezuela has three tests that are developed in phases. The tests vary depending on the grade in which the student is. Each of these tests has a unique structure, scoring system and difficulty:",
    "exampre": "Preliminary Test: This test is carried out prior to the regional tests, where only simple selection questions are made which are configured from the CMS, placing the correct answer, the score, area and difficulty. Furthermore, these tests are calculated automatically. An operator can make manual corrections in case the system does not find the student who took an exam (Physical). As well, they can make edits to the answers, as long as they have the corresponding privileges.",
    "examRegional": "Regional Test: This test is carried out by students who passed the preliminary test. The test has a system to do it online, and it can also be done in person. The questions in this exam are compound. They can be of simple selection, explanation of answers and you can even attach images to the answers in case you do it online. The correction of the answers are made by teachers assigned from the CMS. Where they place the score and an observation of the student's response and explanation of the score. Exam corrections are anonymous, this means that teachers do not know whose test they are correcting is.",
    "examNational": "National Test: This test is presented by students who passed the regional test. As the Regional can be done online or in person, the questions are similar to those of the regional test as well as their correction by the teachers. Although, their scoring system is different.",
    "feature1title": "Responsive Web Design",
    "feature1": "The website can be viewed on any device and continue to behave efficiently on mobile devices.",
    "feature3title": "Use of SVG's",
    "feature3": "For the images within the web page, SVGs were used to improve loading times, as well as various elements were made with pure CSS.",
    "feature4title": "Exportation to Excel",
    "feature4": "Both the website and the CMS allow data to be exported to Excel, in the case of the website, schools can export lists with their participants, just as in the CMS the answers of the exams can be exported.",
    "feature5title": "Reduced HTTP requests",
    "feature5": "Requests to the server are reduced to improve loading times in cases of long information lists such as participant lists.",
    "feature6title": "Big exports with Zip",
    "feature6": "In the case of downloading a large amount of information, such as the list of participants in total, these can be more than 10,000, to improve the download times of the packages."
  },
  "fjcintranet": {
    "resume": "It is an internal single page system (SPA). Created with Angular 8 and Java Spring, for document and discovery management at the Jacinto Convit Foundation. A website that has international standards and under the ISO 9001 standard.",
    "role": "Manager/Fullstack",
    "cmsresult": "CMS",
    "dsc": "Internal system for document management and findings processes",
    "intro": "The Fundación Jacinto Convit (FJC) is a non-profit institution that preserves, protects and continues the work, projects, values ​​and philosophy of the doctor, scientist and humanist Dr. Jacinto Convit.",
    "intro2": "Due to the large number of documents handled by the foundation, the main objective of the internal system that we achieved was to improve the management of large amounts of documents. Also, the foundation having the ISO 9001 license, must meet certain quality criteria, which is why the internal system has the management of these processes both for problem solving and for auditing them. The Fundacion Jacinto Convit has offices in Venezuela and the US, which is why the system was developed in two languages, English and Spanish.",
    "intro3": "For the CMS, an administration was created for each existing module in the application, as well as managing the users of the system and their activity in it. In this system controller all the data found in the modules can be monitored. As well as having a controller for the calls made to the database if necessary.",
    "intro4": "For the development of this CMS, a general template was used to visualize each module. While, for user management, there is a privilege system so that only predefined users can interact with specific modules.",
    "feature1title": "CMS",
    "feature1": "The system has a Content Management System to monitor the internal system, this has the possibility of viewing, creating, editing or deleting any type of information that the entered system has. Having in turn set aside to monitor user activities and limit them.",
    "feature2title": "High Performance",
    "feature2": "The system has great performance thanks to the use of Java Spring Boot, which allows managing cached information to improve loads. Also, its great speed is due to the simplicity of the information that is required for each process.",
    "feature3title": "Document Creation",
    "feature3": "The document management module allows users to create both Word and Excel documents, it also allows to save other types of files that are necessary. Templates can be uploaded from the CMS",
    "feature4title": "Calendar with Alerts",
    "feature4": "The calendar was created to organize activities within the foundation, such as meetings or events, they also allow you to keep track of the tasks that must be done in the findings for their resolution.",
    "feature5title": "Multi-language",
    "feature5": "The system is in both English and Spanish, because the institution has different offices around the world, that is why this information must be contracted in both languages ​​for better use and a better user experience."
  },
  "afxtrade": {
    "resume": "It is a web application created with HTML5, CSS3, JS and PHP. A Venezuelan cryptocurrency exchange in which we can work with different cryptocurrencies such as BTC, USDT, PTR and more. With a comfortable interface allowing any user to use it. In addition, with a unique handling for each currency.",
    "dsc": "Venezuelan cryptocurrency exchange platform",
    "role": "Fullstack",
    "intro1": "AFX is a platform for digital asset exchanges in Venezuela, with the aim of providing innovative solutions, supported by a modern, robust and easy-to-use technological platform, integrating the financial and digital world under the highest standards of quality, transparency and security.",
    "intro2": "AFX Trade was born from the need for a cryptocurrency exchange, in which the cryptocurrencies with the most demand such as Bitcoin, Tether, Dash, Ethereum and many more can be used. Also having integration with FIAT currencies such as the Dollar, Bolívares and Euros. With a modern and comfortable interface. As well as with all the functionalities that involve managing monetary assets such as making deposits, transfers, withdrawals and exchanges.",
    "integrationsTitle": "Integrations",
    "integrationsDsc": "The cryptocurrencies and FIAT currencies used in AFX Trade have a unique handling, since, in the case of cryptocurrencies, they were directly integrated with the blockchains of each one, for this the required nodes were created for each cryptocurrency. In addition, each user has a unique address to which they can make funding or withdrawals at any time without the need for third parties. As well as, each of these integration has a different handling since each one interacts with a different node. On the other hand, in the case of FIAT currencies such as the Bolivar, you can make deposits and withdrawals in a traditional way. That is, you report the deposit or withdrawal and an operator is in charge of carrying out the action and validating it. Although, you can make movements quickly using mobile payment. This integration allows you to carry out movements without the need for third parties. AFX Trade also has internal messaging, SMS and mail. As well as with double authentication.",
    "bsIntegration": "Traditional deposits and withdrawals, validated and made by an operator from the CMS.",
    "bitcoinIntegration": "Deposits and withdrawals through a private BTC node, generation of independent wallets, automated processes and minimum commission depending on the Bitcoin blockchain.",
    "petroIntegration": "Deposits and withdrawals through a private SUNACRIP API, wallet generated from a central wallet with automated processes.",
    "dolarIntegration": "Traditional deposits and withdrawals, validated and made by an operator from the CMS.",
    "pagoMovilIntegration": "Deposits and withdrawals through the Banco Plaza API, the data is previously validated to be used through the API. It does not require an operator for its execution.",
    "usdtIntegration": "The movements are executed through the Tether network. Keeping commissions low. As well as, TRX is managed for the creation of the wallets.",
    "etherumIntegration": "Coming soon",
    "dashIntegration": "Coming soon",
    "segurityTitle": "SEGURITY",
    "segurityDsc": "In the security section, several things are taken into account, when making movements such as transfers, withdrawals, deposits or exchanges. As well as when you register, the information becomes validated by an operator. All the actions you carry out are notified with an SMS or by email as long as you have the notifications activated.",
    "comTitle": "COMMUNICATIONS",
    "comDsc": "There is an internal messaging between users and operators, which, like the actions carried out, can be notified by SMS or mail if necessary by the operators. This communication is carried out by departments depending on the problem that the user presents or the help he needs.",
    "movementTitle": "MOVEMENTS",
    "movementDsc": "The movements that are generated are made with the greatest security. If in the middle of a movement something fails, the movement is not created until it is completed. As well as the user can see the detail of each of the movements that he has made, the commission they have generated and their status. When making a deposit or withdrawal, the amounts of these movements can be frozen while waiting for an operator to release it or the block to be confirmed. As well as they can be canceled due to lack of confirmations or in the case of being traditional, due to lack or data errors.",
    "exchangeTitle": "EXCHANGES",
    "exchangeDsc": "When making an exchange we have two options, through a limit or market order. Limit orders allow you to place buy and sell orders the amount you want at the price you want under the market standard. Whereas, market orders are executed immediately by buying the amount you want at the market price. Both orders can be partially completed, in the case of the market if there is no liquidity the order is completed up to the maximum liquidity, while the limit can be partially completed depending on the amount that the market orders buy or sell. The exchanges generate exit and entry movements for the market order, limit orders and generated commissions, these movements are saved in detail allowing users to know exactly how an exchange is executed.",
    "cmstitle": "CMS",
    "cmsintro1": "The CMS created for AFX Trade contains everything you need for autonomous site administration, as well as adding FIAT coins with traditional deposit and withdrawal methods. Creation of exchange pairs, as well as the commissions and limits of each user. This CMS has a system of roles and privileges for the operators who use it, either to validate user information, validate operations, monitor exchanges, customer service, and also has an audit for both the client and the client side. CMS to be aware of the actions that are carried out in the client and in the CMS.",
    "cmsintro2": "It has report generation in both Excel and PDF generated with PHP. These reports can be generated whenever they are needed.",
    "featuretitle1": "Export to Excel and PDF",
    "feature1": "From the CMS, automatic reports can be generated in PDF and Excel lists of the required data can also be generated. These documents are generated from the backend with PHP.",
    "featuretitle2": "Optimized endpoints",
    "feature2": "The endpoints created for AFX Trade have Queries optimization, so that heavy data queries such as graphs, orders, movements and exchanges will be executed quickly so that the user experience is fluid and pleasant.",
    "featuretitle3": "Secure data insertion",
    "feature3": "In PHP there are transactions, which allow you to activate a series of processes where, if any process fails, no process of the series is executed. These transactions allow there to be no discrepancies in the data or incomplete insertions.",
    "featuretitle4": "Roles and privileges system",
    "feature4": "In the CMS, there are roles and privileges that allow actions within it, differing with modules and with different actions in each one. While on the client side, there is a system of levels and roles that make the commissions and limits of the user different.",
    "featuretitle5": "Unique integrations",
    "feature5": "As explained in the integrations section, each cryptocurrency was integrated in a unique way, no global libraries or global nodes were used for cryptocurrencies, but each one is treated individually. As with transaction processes such as Mobile Payment.",
    "featuretitle6": "CRON's creation",
    "feature6": "To maintain a clean database and to validate movements and exchanges. Different processes were created to validate incoming transactions, expired wallet addresses, incomplete transactions, and many more. They are all parts of different CRONs that run for a certain time."
  },
  "traumapp": {
    "dsc": "Mobile application to manage medical consultations and medical records",
    "role": "Creator / Fullstack",
    "intro1": "TraumApp is a mobile application created to speed up medical consultations. Allowing you to manage patient information, schedule medical appointments, create automated reports, create recipes with the medications of your choice, export to PDF and much more.",
    "intro2": "TraumApp is an application that I have been working independently together with the designer <a href='https://www.linkedin.com/in/magreyt/' target='_blank'>Magrey Touissainte</a>.",
    "intro3": "This application allows you to manage your patients in an easy and comfortable way, allowing you to have a clinical history and a medical file in one place. In addition, it allows you to schedule your medical consultations, scheduling patients at certain times and marking their time of entry and exit. It has a Register Mode in which an administrator or the patients themselves can register or mark that they attended the medical consultation. Also, the user can assign medical insurances to patients and medicines to recipes, having his own lists with the insurances and medicines with which the user often works. It should be noted, the reports section allows you to automatically generate the medical history of the patient's consultation. Allowing the user to create the story quickly and avoid leaving details of the query. As well as, this medical history can be exported PDF or printed via Bluetooth.",
    "visualResult1": "The login is through username (Email) and password, where you can see your password if necessary, if you already have an active session, it will send you directly to the main menu.",
    "visualResult2": "The main menu allows you to navigate to the various modules such as Patients, Calendar and Settings. Also, in the event that you have patients scheduled for the day you enter, it will show you the appointments in order of entry.",
    "visualResult3": "The calendar will show you the days you had or will have scheduled appointments. To see the appointments for a single day you must click on it and the appointments you have for that day will appear. In case you have advanced too much, you can always return to Today by simply pressing it.",
    "visualResult4": "The register mode allows you to register patients and confirm medical appointments. This allows an administrator or even the patients themselves to be added to the list. As well as confirming your presence at the appointment. On the other hand, to exit this mode it must be done with a security PIN. To prevent another person from entering the application as such.",
    "titlePatients": "Patients",
    "dscPatients": "From this module, we can manage our patients, allowing us to add new patients, edit the patients that we have already entered, and be able to see their clinical file in detail, such as their personal information, medical records and recipes that the patient has. When searching for a patient, we can filter by all their attributes, as well as order the records. To keep this screen optimized, a limit of patients is shown, allowing the user to continue showing more patients in case they need it. On the other hand, when viewing the user's file, the stories and recipes can be filtered by order or name they have.",
    "registerPatients": "In the patient's registry, we have mandatory data that is necessary to create their personal file, histories and recipes. As well as extra data that allow you to have a more complete file. In addition, a medical insurance can be linked to each patient who registers.",
    "titleForms": "Reports",
    "dscForms": "The reports section is the most complex, since from a simple form, user can create an automated medical report. In TraumApp there are different forms where each of them is different and, in turn, the report they generate is different. In addition, these reports can be modified if necessary. On the other hand, the stories can be exported to PDF format or only be saved in the system. If the user has the automatic report sending, this will automatically send their medical report to the patient in case they need it. On the other hand, the recipes are also generated automatically, the user only has to add the medications and the quantity along with the indications and this will be generated, and like the reports, it can be exported to PDF or saved in the system.",
    "titleCalendar": "Calendar",
    "dscCalendar": "In the calendar module we can have a view of our scheduled appointments as well as our past appointments. Allowing us to see in detail the appointments of each day and make a record of unsaved appointments or future appointments. This module allows you to schedule appointments and relate them to patients that we have already entered, as well as add a short description of the appointment. Within the appointment file, we can send a notification to the user via WhatsApp informing him about the appointment. Also, we can change the status of the appointment, informing that the patient attended his consultation or that he could not attend. On the other hand, we can delete or edit the appointments that have been entered incorrectly.",
    "titleConfig": "Configuration",
    "dscConfig": "In the TraumApp configuration we have multiple functions, from viewing and editing our user's data to adding medication and health insurance records. We can also contact support from here allowing us to send an email easily. In addition, we can configure what the Register Mode is, adding the security PIN to exit the Register Mode and we can also access this mode. Where we can perform basic actions such as admitting patients or confirming medical appointments. In case we are Premium users, we can export patient data and appointments to Excel. As well as enabling him to send automatic reports. On the other hand, we can activate or deactivate the Dark Mode, which only visually influences the application.",
    "userTitleConfig": "User",
    "userDscConfig": "From the users section we can see the data we have, our plan and even change the password with ease. In addition, we can edit our information except for the main email (user) and personal identification (DNI).",
    "medicineTitleConfig": "Medications and Insurance",
    "medicineDscConfig": "We can have a list of medications and insurance of our preference, allowing us to enter and use them in our records. In the case of insurance, they are related to patients. Whereas, the drugs are loaded into the form to generate it.",
    "registerModeTitleConfig": "Reguster Mode",
    "registerModeDscConfig": "The register mode allows the user to give their device so that the patient or an administrator can perform basic actions such as registering patients or confirming attendance at the day's medical appointment.",
    "principalFeatures": "Principal Features",
    "principalFeatureTitle1": "Data export",
    "principalFeatureDsc1": "The PDFs that are generated in the creation of medical reports are generated in a unique and fast way. allowing the user to manipulate them without any problem. As well as the printing of these. Moreover, the export of patient or appointment data to Excel. Allowing the user to monitor the data that is necessary.",
    "principalFeatureTitle2": "Multiple forms",
    "principalFeatureDsc2": "In the reports section, there are multiple forms, each of which is different. This allows the generation of medical reports to be more detailed. Each form is centered on a body part, allowing you to enter details of the body part you are evaluating.",
    "principalFeatureTitle3": "Digitization",
    "principalFeatureDsc3": "Notebooks, sheets and folders are still used in many medical offices to carry personal files and medical records of patients. With TraumApp, the records and processes that a medical office needs are digitized.",
    "featureTitle1": "Multiplatform technology",
    "featureDsc1": "Although it is currently only available in the Play Store. React Native allows you to compile applications also for iOS, therefore, it could be published in the iOS App Store.",
    "featureTitle2": "Report automation",
    "featureDsc2": "The forms were created in detail so that their creation was automatic and efficient. This allows for a standard in medical reports and greater agility when creating a report.",
    "featureTitle3": "Users and privileges",
    "featureDsc3": "There are different levels of users who can perform different actions between them, from exporting data to Excel to automating the sending of reports",
    "featureTitle4": "Report notification by mail",
    "featureDsc4": "After having completed a report, it can be automatically sent to the patient who was made, thus allowing the patient to have their own medical report if necessary.",
    "featureTitle5": "Dark Mode",
    "featureDsc5": "If you got this far, you could realize that TraumApp has a light design and a dark design, which can be activated whenever the user wants. Both designs are carefully created to maintain a good color harmony.",
    "resume": "It is a multiplatform mobile application developed with React Native. It has a comfortable interface for the user and improve its daily use. Created to optimize a medical consultation and the management of patient information."
  },
  "traumappLanding": {
    "resume": "",
    "dsc": "",
    "role": ""
  },
  "knowlegde": {
    "firstDsc":"I’m very familiar using web tecnhologies like HTML5, CCS3, TypeScript and JavaScriptunder the ECMAScript standard from version 6 to version 11.",
    "secondDsc":"I have worked on the Front-end with frameworks like Angular and React with their libraries like Material UI and Angular Material, also I have experience building responsive websites with a high-performance.",
    "thirdDsc":"Otherwise, I’m familiar using the framework React Native for building across-platform Apps. and Also, Electron in the case of cross-platform desktop applications",
    "quarterDsc":"However, In the back-end I have used PHP and Java for the creation of REST API, using both SQL and NoSQL databases. Such as MySQL, PostgreSQL, MongoDB, Realm and Firebase.",
    "fiftDsc":"Additionally, I have worked under SCRUM and Kanban methodologies with tools such as Trello, Jira, Slack and Confluence. Also, I have knowledge of visual tools like Figma, Zeplin, MarvelApp and Mockflow."
  },
  "about":{
    "resume":"I'm a Venezuelan web designer and a mobile developer<br>I really like to create useful and intuitive products with comfortable visual interfaces for everybody.",
    "aboutLink":"Read more about me",
    "welcome": "Hello!",
    "intro":"My name is Samuel<br>I am a web designer and mobile developer currently working as freelance programmer, I am in Caracas, Venezuela.",
    "whatILike": "I really like to make useful and intuitive products with comfortable visual interfaces for anyone. I like to analyze the user context in order to create the best solution on each project. I have experience making cross-platform applications and working as fullstack developer on various projects. Building responsive websites and creating REST API.",
    "tec": "I'm very familiar using HTML5, CSS3, TypeScript and JavaScript. On the Front-end side I have used frameworks such as Angular and React for websites, React Native for mobile applications and Electron for Desktop applications. On the other hand, in the Back-end I have worked mostly using PHP to create REST API web services, although I also have exprience using Java. I have worked with relational databases and non-relational databases. Being MySQL and Firebase the engines which I have worked the most. Also, I have worked with Realm, PostgreSQL and MongoDB.",
    "keepingUp": "For always keeping me updated, I take courses, read updated documentation, watch lectures and watch YouTube videos to learn about new technologies.",
    "contact": "If you have a project, you are interested in a collaboration or just want to say hello, don't hesitate to send me an email to contact@samueldear.com.",
    "spam": "You can also know more about me here:"
  },
  "slideMenu":{
    "homeLink": "HOME",
    "projectsLink": "PROJECTS",
    "knowlegdeLink": "KNOWLEGDE",
    "whoDesigned": "WHO DESIGNED THIS?",
    "aboutLink": "ABOUT ME",
    "studies": "STUDIES"
  },
  "project": {
    "role": "Role:",
    "agency": "Agency:",
    "date": "Date:",
    "introTitle": "Introduction",
    "visualRes": "Visual Result",
    "typoColor": "Typography - Color",
    "features": "Features",
    "thanks": "Thanks for Watching!",
    "hereMore": "Here you can know more ",
    "aboutLink": "about me",
    "otherWork": "You can see my other works!"
  }
}
