{
  "copy": "© 2021, All rights reserved.",
  "header": {
    "aboutButton": "ABOUT ME"
  },
  "home": {
    "presentation": "Hello! My name is Samuel Rojas.",
    "description": "I'm a web and mobile developer that build responsive websites and development cross-platform Apps.",
    "linkProject": "View Project",
    "msgContact": "Feel free to contact me on",
    "submsgContact": "Or you can send me an email from here!",
    "labelName": "Name",
    "labelEmail": "Email",
    "labelDscEmail": "Message",
    "btnText": "Send",
    "requiredInput": "This field is required.",
    "invalidEmail": "Invalid email."
  },
  "quipus": {
    "resume": "Thematic pools events where each event was unique and had different technologies such as Angular, React and Node on the backend side. Spatially designed to be visited from mobile devices with a navigability designed to entertain.",
    "dsc": "Thematic event pools page",
    "role": "Frontend",
    "intro": "Quipus starts from the idea of ​​connecting people through events in which users can choose their favorite winners depending on the theme, which can be very varied. Going through contests of Works on Jose Gregorio Hernández, The Oscars, The Miss Universe and sporting events such as the Copa América and the Eurocopa. Allowing users to see the choices of others, and having different rooms in which you can create a Quipu (Quiniela). Each of these events was carried out as a unique project, thus allowing users to have new ways of playing and participating.",
    "jgh": {
      "dsc1": "The Jose Gregorio Hernández event was a poster or illustration contest, where the illustrations were anonymously, and users had to choose their favorite through a Versus system, in which two illustrations were shown and the user chose which one. her favourite. The scores for these illustrations were calculated with an ELO rating system.",
      "dsc2": "There were two categories, one for youth and the other for adults. Where the youth you had to choose your favorite within several groups. While in the adult one, you had to choose your favorite in a Versus, allowing you to perform a maximum of 23 rounds.",
      "dsc3": "At the end of the event, the illustrations would go to a ranking where their position and the name of the work would appear.",
      "featureTitle1": "Gallery",
      "featureDsc1": "It has a Gallery so that people can see all the illustrations that you are participating in in greater detail."
    },
    "oscars": {
      "dsc1": "The Oscars event is based on the Academy Awards. In which people could see the different nominees and their categories. As well as news of the event's news. In the gallery of the nominees you could see the trailer of the films.",
      "dsc2": "In this event, people could select the winners of each category. In this system, there were two types of selections, the normal ones and the bonuses, where the normal ones scored 1 point and the bonuses 3 for hit. After finishing your selections, you could see a list with the participants and you could edit your selection before the event started.",
      "dsc3": "After the event ended, users could see their position in the ranking, as well as see the details of all users. In addition, they had a section with the results of the academy awards where they could see which were the winners of each category.",
      "featureTitle1": "Results",
      "featureDsc1": "There is a screen with the results of the event so that users can enter after the event is over and can see what the real results were."
    },
    "miss": {
      "dsc1": "The Miss Universe event allowed people to choose their favorite candidates for the beauty pageant. Where they could also view the candidates in a gallery by region.",
      "dsc2": "The betting process ran from round 1 where the 32 best candidates are selected to the final round where the winner is voted on. Users could participate in different salaries and place different bets. Also as long as the event was not in progress or finished, they could edit their forecast. As well as, they could see the forecasts of other people after the participation closed."
    },
    "copas": {
      "dsc1": "The cup event included what was the America's Cup and the European Championship. From their group stage to their final stage. For this event different modes were made for each event. Each event had a group stage and final stage mode, and a mode for only the final stage with the actual results already obtained. In this case, the points system varied from the event, as well as an auto-completion system for the results forecast, which allowed users with little knowledge to complete the pool with the help of an automated forecast.",
      "dsc2": "Each event had a group stage and final stage mode, and a mode for only the final stage with the actual results already obtained.",
      "dsc3": "In this case, the points system varied from the event, as well as an auto-completion system for the results forecast, which allowed users with little knowledge to complete the pool with the help of an automated forecast.",
      "featureTitle1": "Brackets",
      "featureDsc1": "For the final phase, brackets were developed to make the filling experience more pleasant. These brackets were developed to withstand any match and result.",
      "featureTitle2": "Predictor",
      "featureDsc2": "For the group stage, the user had to go game by game filling in the result, some like this and others not, that is why he decided on an automatic filling which was based on statistical data for filling."
    },
    "commonFeatures": {
      "featureTitle1": "Responsive Design",
      "featureDsc1": "The event has a responsive design because it is more mobile-oriented. Allowing anyone to participate on any device.",
      "featureTitle2": "Reduced HTTP",
      "featureDsc2": "The requests in this event are reduced, because they are only used in certain sites, since the simplicity is that only data is shown and only the user's vote is saved.",
      "featureTitle3": "Firebase",
      "featureDsc3": "To enter with Gmail, it was done through Firebase for its integration.",
      "featureTitle4": "CMS",
      "featureDsc4": "The event goes through different stages, from when people participate until the results of the event are seen as such. That is why these stages must be managed from a CMS, as well as monitoring the results and selections.",
      "featureTitleTwitter": "Twitter Timeline",
      "featureDscTwitter": "To keep up with the news of the event, there is a Twitter Timeline where you can see the tweets related to the event."
    }
  },
  "knowlegde": {
    "firstDsc":"I’m very familiar using web tecnhologies like HTML5, CCS3, TypeScript and JavaScriptunder the ECMAScript standard from version 6 to version 11.",
    "secondDsc":"I have worked on the Front-end with frameworks like Angular and React with their libraries like Material UI and Angular Material, also I have experience building responsive websites with a high-performance.",
    "thirdDsc":"Otherwise, I’m familiar using the framework React Native for building across-platform Apps. and Also, Electron in the case of cross-platform desktop applications.",
    "quarterDsc":"However, In the back-end I have used PHP and Java for the creation of REST API, using both SQL and NoSQL databases. Such as MySQL, PostgreSQL, MongoDB, Realm and Firebase.",
    "fiftDsc":"Additionally, I have worked under SCRUM and Kanban methodologies with tools such as Trello, Jira, Slack and Confluence. Also, I have knowledge of visual tools like Figma, Zeplin, MarvelApp and Mockflow."
  },
  "about":{
    "resume":"I'm a Venezuelan web designer and a mobile developer.<br>I really like to create useful and intuitive products with comfortable visual interfaces for everybody.",
    "aboutLink":"Read more about me",
    "welcome": "Hello!",
    "intro":"My name is Samuel<br>I am a web designer and mobile developer currently working as freelance programmer, I am in Caracas, Venezuela.",
    "whatILike": "I really like to make useful and intuitive products with comfortable visual interfaces for anyone. I like to analyze the user context in order to create the best solution on each project. I have experience making cross-platform applications and working as fullstack developer on various projects. Building responsive websites and creating REST API.",
    "tec": "I'm very familiar using HTML5, CSS3, TypeScript and JavaScript. On the Front-end side I have used frameworks such as Angular and React for websites, React Native for mobile applications and Electron for Desktop applications. On the other hand, in the Back-end I have worked mostly using PHP to create REST API web services, although I also have exprience using Java. I have worked with relational databases and non-relational databases. Being MySQL and Firebase the engines which I have worked the most. Also, I have worked with Realm, PostgreSQL and MongoDB.",
    "keepingUp": "For always keeping me updated, I take courses, read updated documentation, watch lectures and watch YouTube videos to learn about new technologies.",
    "contact": "If you have a project, you are interested in a collaboration or just want to say hello, don't hesitate to send me an email to contact@samueldear.com.",
    "spam": "You can also know more about me here:"
  },
  "project": {
    "role": "Role:",
    "agency": "Agency:",
    "date": "Date:",
    "introTitle": "Introduction",
    "visualRes": "Visual Result",
    "typoColor": "Typography - Color",
    "features": "Features",
    "thanks": "Thanks for Watching!",
    "hereMore": "Here you can know more ",
    "aboutLink": "about me",
    "otherWork": "You can see my other works!",
    "visitProject": "Visit"
  }
}
