{
  "header": {
    "aboutButton": "ABOUT ME"
  },
  "home": {
    "presentation": "Hello! My name is Samuel Rojas.",
    "description": "I'm a web designer and mobile developer that build responsive websites and development cross-platform Apps.",
    "linkProject": "View Project"
  },
  "myWeb": {
    "resume": "A website that is a Single-page application(SPA). With a high-performance, responsive website that uses powered animations. As also, uses the creative SVG's power for enriching user experience."
  },
  "orm": {
    "resume": "It is a web page created with HTML5, CSS3, JS and PHP. a responsive website with a comfortable design to facilitate the user experience and high performance. Created to make it easier for schools in Venezuela to register for the Mathematical Recreation Olympics."
  },
  "fjcintranet": {
    "resume": "It is an internal single page system (SPA). Created with Angular 8 and Java Spring, for document and discovery management at the Jacinto Convit Foundation. A website that has international standards and under the ISO 9001 standard."
  },
  "knowlegde": {
    "firstDsc":"I’m very familiar using web tecnhologies like HTML5, CCS3 and JavaScript. and also I have used frameworks such as Angular and React.",
    "secondDsc":"I have experience using ES6, ES7 and TypeScript, also I have experience building responsive websites with a high-performance.",
    "thirdDsc":"Otherwise, I’m familiar using the framework React Native for building across-platform Apps.",
    "quarterDsc":"However, In the back-end I have used PHP and Java, using both SQL and NoSQL databases. Such as MySQL, PostgreSQL, MongoDB, Realm and Firebase."
  },
  "about":{
    "resume":"I'm a Venezuelan web designer and a mobile developer<br>I really like to create useful and intuitive products with comfortable visual interfaces for everybody.",
    "aboutLink":"Read more about me",
    "welcome": "Hello!",
    "intro":"My name is Samuel<br>I'm a Venezuelan web designer and a mobile developer currently studying systems engineering in Caracas, Venezuela.",
    "whatILike": "I really like to make useful and intuitive products with comfortable visual interfaces for anyone. I like to analyze the user context in order to create the best solution on each project. I have experience making cross-platform applications and working as front-end developer in some projects. as well, I have builded responsive websites.",
    "tec": "Although I am very familiar with frameworks such as React Native, React and Angular for application development, most of the websites I have developed were coded primarily by hand with HTML5, CCS3, JavaScript and PHP.",
    "keepingUp": "For always keeping me updated, I read books, read updated documentation, watch lectures and watch YouTube videos to learn about new technologies.",
    "contact": "If you have a project, you are interested in a collaboration or just want to say hello, don't hesitate to send me an email to samuel_dear@hotmail.com",
    "spam": "You can also know more about me here:"
  },
  "slideMenu":{
    "homeLink": "HOME",
    "projectsLink": "PROJECTS",
    "knowlegdeLink": "KNOWLEGDE",
    "whoDesigned": "WHO DESIGNED THIS?",
    "aboutLink": "ABOUT ME"
  },
  "project": {
    "role": "Role:",
    "agency": "Agency:",
    "date": "Date:",
    "introTitle": "Introduction",
    "visualRes": "Visual Result",
    "typoColor": "Typography - Color",
    "features": "Features",
    "thanks": "Thanks for Watching!",
    "hereMore": "Here you can know more ",
    "aboutLink": "about me",
    "otherWork": "You can see my other works!"
  }
}
