{
  "copy": "© 2021, Todos los derechos reservados.",
  "header": {
    "aboutButton": "SOBRE MÍ"
  },
  "home": {
    "presentation": "Hola! Mi nombre es Samuel Rojas.",
    "description": "Soy un desarrollador web y móvil que hace páginas web responsivas y desarrolla aplicaciones móviles multiplataforma.",
    "linkProject": "Mirar Proyecto",
    "msgContact": "Siéntete libre de enviarme un correo a",
    "submsgContact": "O puedes enviarme un correo desde aquí!",
    "labelName": "Nombre",
    "labelEmail": "Correo",
    "labelDscEmail": "Mensaje",
    "btnText": "Enviar"
  },
  "myWeb": {
    "resume": "Es un sitio web de página única(SPA). Con un alto rendimiento, un sitio web responsivo que utiliza animaciones potentes. También, usa el poder de los SVG para enriquecer la experiencia del usuario.",
    "dsc": "Mi propio sitio web donde enseño las cosas que hago",
    "agency": "Proyecto Personal",
    "role": "Dueño/Desarrollador",
    "intro": "El diseño de mi portafolio fue hecho por mi mismo, desde el inicio quería que fuera un sitio web en modo oscuro, ya que no soy muy fanático del modo claro. También, que contara con animaciones sencillas para no saturar la experiencia del usuario.",
    "intro2": "Durante el desarrollo se fueron agregando detalles que no estaban en el punto inicial para hacer una experiencia más fluida. Un sitio web que aprovecha el uso de SVGs para un mejor renderizado y de una navegación sencilla para un mejor flujo en la página web.",
    "feature1title": "Diseño Web Responsivo",
    "feature1": "El diseño de la página es escalable a dispositivos móviles y a cualquier resolución, comportándose de manera eficiente en cualquier dispositivo y permitiendo que cualquier usuario pueda disfrutar de la página web.",
    "feature2title": "Uso de SVGs",
    "feature2": "La página web cuenta con imágenes SVG para mejorar los tiempos de cargas y que la descarga sea más eficiente. También, para que la calidad de las imágenes sea la misma en cualquier pantalla.",
    "feature3title": "Animaciones Sencillas",
    "feature3": "Cada detalle de la página cuenta con una animación sencilla para no sobrecargar el sitio con animaciones. Es por ello que cuenta con animaciones sencillas estilo fade-out, fade-in y slide.",
    "feature4title": "Transición interactiva",
    "feature4": "Para la navegación entre pantallas, se desarrollo una transición sencilla para una mejor experiencia a la hora de navegar entre las pantallas. También, a la hora de navegar puedes determinar donde te encuentras por la forma del hamburguer-menu.",
    "feature5title": "Diseño Web Amigable",
    "feature5": "La paleta de colores es bastante sencilla, ya que el tema principal es modo oscuro. Cuenta con colores sencillos y elementos sencillos para que sea un sitio amigable.",
    "feature6title": "Acerca de la página",
    "feature6": "Para mostrar las redes sociales, decidí colocar un pie de página en el que se pudieran visualizar de mejor manera, igual al momento de ver más sobre mí, puedes encontrar mi redes sociales.",
    "feature7title": "Diseño Personalizado Para Cada Proyecto",
    "feature7": "Cada página de un proyecto, tiene elementos personalizados para que los detalles de los proyectos puedan ser mejor apreciados."
  },
  "orm": {
    "resume": "Es una página web creada con HTML5, CSS3, JS y PHP. Un sitio web responsivo con un diseño cómodo para facilitar la experiencia del usuario y de un alto rendimiento. Creado para facilitar a los colegios de Venezuela la inscripción a las Olimpiadas Recreativas de Matemáticas.",
    "dsc": "Página Web para la administración de las Olimpiadas Recreativas de Matemáticas de Venezuela",
    "role": "Fullstack",
    "intro": "Las Olimpíadas Recreativas de Matemáticas de Venezuela es un evento con el objetivo de Desarrollar estrategias para la enseñanza de las matemáticas, mejorar el nivel académico y estimular en los niños el uso de sus capacidades intelectuales: comprensión, capacidad de síntesis y juicio crítico.",
    "intro2": "En las Olimpiadas Recreativas de Matemáticas se inscriben una gran cantidad de colegios los cuales inscriben una gran cantidad de alumnos, el objetivo principal del sitio web, es el de permitirle a los colegios registrar y administrar sus participantes, también permite que los organizadores de las olimpiadas puedan tener una administración óptima de toda la información de el evento, como los datos de los colegios, alumnos y exámenes.",
    "cmstitle": "CMS",
    "cmsintro": "Para administrar la información de los colegios, alumnos y exámenes, se desarrollo un Content Managment System con la finalidad de que la información se pueda visualizar, crear, editar o borrar. También, cuenta con un sistema de privilegios para que existan diversos roles dentro de la administración. Es decir, que para realizar diversas acciones debes tener privilegios para hacerlo. Cuenta con un sistema de auditoria en el que cual se monitorean las acciones que se han realizado dentro del CMS. Ademas, cuenta con exportación a Excel de los datos que sean necesarios, ya sea una lista de alumnos, de colegios o de exámenes. Incluso, este permite hacer correcciones manuales a los exámenes que fueron presentados de manera presencial en caso de que el sistema no haya podido identificar a que participante pertenece.",
    "examtitle": "EXÁMENES",
    "examdsc": "La Olimpiada Recreativa de Matemáticas de Venezuela, cuenta con tres pruebas que se desarrollan por fases. Las pruebas varían dependiendo del grado en el que se encuentre el estudiante. Cada una de estas pruebas cuenta con una estructuración, sistema de puntaje y dificultad único:",
    "exampre": "Prueba Preliminar: Esta prueba es realizada previamente a las pruebas regionales, donde se realizan unicamente preguntas de selección simple las cuales son configuradas desde el CMS, colocando la respuesta correcta, el puntaje, área y dificultad. Ademas, estas pruebas son calculadas automáticamente. Un operador puede realizar correcciones manuales en caso de que el sistema no encuentre el alumno que realizo un examen(Físico). Como también, pueden hacer ediciones de las respuestas, siempre y cuando cuente con los privilegios correspondientes.",
    "examRegional": "Prueba Regional: Esta prueba es realizada por los alumnos que aprobaron la prueba preliminar. La prueba cuenta con un sistema para realizarla de manera online, y también puede ser realizada de manera presencial. Las preguntas de este examen son compuestas. Pueden ser de selección simple, explicación de respuestas e incluso puedes adjuntar imágenes a las respuestas en caso de que lo hagas online. La corrección de las respuestas son realizadas por profesores asignados desde el CMS. Donde ellos colocan el puntaje y una observación a la respuesta del alumno y explicación del puntaje. Las correcciones de los exámenes son anónimas, esto quiere decir que los profesores no saben de quien es la prueba que están corrigiendo.",
    "examNational": "Prueba Nacional: Esta prueba es presentada por los alumnos que aprobaron la prueba regional. Al igual que la Regional puede ser realizada de manera online o presencial, las preguntas son similares a las de la prueba regional así como también su corrección por los profesores. Aunque, su sistema de puntaje es diferente.",
    "feature1title": "Diseño Web Responsivo",
    "feature1": "La página web puede ser visualizada en cualquier dispositivo y seguir comportándose de manera eficiente en dispositivos móviles.",
    "feature3title": "Uso de SVGs",
    "feature3": "Para las imágenes dentro de la página web se usaron SVGs para mejorar los tiempos de carga, así como también diversos elementos fueron hechos con CSS puro.",
    "feature4title": "Exportación a Excel",
    "feature4": "Tanto la página web como el CMS permiten exportar datos a Excel, en el caso de el sitio web, los colegios pueden exportar listas con sus participantes, igual que en el CMS pueden ser exportados las respuestas de los exámenes.",
    "feature5title": "Solicitudes HTTP reducidas",
    "feature5": "Las solicitudes al servidor se encuentran reducidas para mejorar los tiempos de carga en los casos de las listas largas de información como pueden ser las listas de participantes.",
    "feature6title": "Exportaciones de gran tamaño con Zip",
    "feature6": "En el caso de descargar una gran cantidad de información, como puede ser la lista de participantes en total, estos pueden ser más de 10.000, para mejorar los tiempos de descarga de los paquetes."
  },
  "fjcintranet": {
    "resume": "Es un sistema interno de página única(SPA). Creado con Angular 8 y Java Spring, para la gestión documental y de hallazgos en la Fundación Jacinto Convit. Un sitio web que cuenta con estándares internacionales y bajo el estándar ISO 9001.",
    "role": "Lider/Fullstack",
    "cmsresult": "CMS",
    "dsc": "Sistema interno para procesos de gestión documental y de hallazgos",
    "intro": "La Fundación Jacinto Convit (FJC) es una institución sin fines de lucro, que preserva, protege y continúa la obra, proyectos, valores y filosofía del médico, científico y humanista Dr. Jacinto Convit.",
    "intro2": "Debido a la gran cantidad de documentos que maneja la fundación, el objetivo principal del sistema interno que logramos fue mejorar la gestión de grandes cantidades de documentos. También, la fundación al contar con la licencia de ISO 9001 debe cumplir con ciertos criterios de calidad, es por ello que el sistema interno cuenta con la gestión de estos procesos tanto para resolución de problemas como para auditorias de los mismos. La Fundación Jacinto Convit cuenta con sedes en Venezuela y en Estados Unidos, es por ello que el sistema fue desarrollado en dos lenguajes, inglés y español.",
    "intro3": "Para el CMS se creó una administración para cada módulo existente en la aplicación, así como también administrar los usuarios del sistema y su actividad en ella. En este controlador del sistema puede monitorearse toda la data que se encuentra en los módulos. Así como también tener un controlador de las llamadas que se hacen a la base de datos en caso de ser necesario.",
    "intro4": "Para el desarrollo de este CMS se usó una plantilla general para visualizar cada módulo. Mientras que, para el manejo de los usuarios, se cuenta con un sistema de privilegios para que solo usuarios predefinidos puedan interactuar con módulos específicos.",
    "feature1title": "CMS",
    "feature1": "El sistema cuenta con un Content Managment System para monitorear el sistema interno, este cuenta con la posibilidad de visualizar, crear, editar o eliminar cualquier tipo de información que tenga el sistema ingresado. Teniendo a su vez apartado para monitorear las actividades de los usuarios y limitarlas.",
    "feature2title": "Alto Rendimiento",
    "feature2": "El sistema cuenta con un gran rendimiento gracias al uso de Java Spring Boot, el cual permite manejar información en caché para mejorar cargas. También, su gran velocidad se debe a la sencillez de la información que es requerida para cada proceso.",
    "feature3title": "Creación de Documentos",
    "feature3": "El módulo de gestión documental permite a los usuarios crear documentos tanto de Word como de Excel, también permite guardar otros tipos de archivos que sean necesarios. Las plantillas pueden ser cargadas desde el CMS.",
    "feature4title": "Calendario con Notificaciones",
    "feature4": "El calendario fue creado para organizar las actividades dentro de la fundación, como reuniones o eventos, permiten llevar también un control con las tareas que deben hacer en los hallazgos para la resolución de estos.",
    "feature5title": "Multi-idioma",
    "feature5": "El sistema se encuentra tanto en inglés como en español, debido a que la institución cuenta con diferentes sedes en el mundo, es por ello que esta información debe encontrarse en ambos idiomas para un mejor uso y una mejor experiencia de usuario."
  },
  "afxtrade": {
    "dsc": "Plataforma Venezolana de intercambio de criptomonedas",
    "role": "Fullstack",
    "intro1": "AFX es una plataforma para intercambios de activos digitales en Venezuela, con el objetivo de aportar soluciones innovadoras, apoyados de una plataforma tecnológica moderna, robusta y fácil de usar, integrando el mundo financiero y digital bajo los más altos estándares de calidad, transparencia y seguridad.",
    "intro2": "AFX Trade nace de la necesidad de un Exchange de criptomonedas, en el cual se puedan usar las criptomonedas con más demanda como lo es el Bitcoin, Tether, Dash, Ethereum y muchas más. También teniendo integración con monedas FIAT como el Dolar, Bolívares y Euros. Con una interfaz moderna y cómoda. Así como también con todas las funcionalidades que implican manejar activos monetarios como realizar depósitos, transferencias, retiros e intercambios.",
    "integrationsTitle": "Integraciones",
    "integrationsDsc": "Las criptomonedas y monedas FIAT utilizadas en AFX Trade tienen un manejo único, ya que, en el caso de las criptomonedas se integraron con las blockchains de cada una de manera directa, para ello se crearon los nodos requeridos para cada criptomoneda. Ademas, cada usuario cuenta con una dirección única a la cual puede realizar fondeos o retiros en cualquier momento sin necesidad de terceros. Así como también, cada una de estas integración tiene un manejo diferente ya que cada una interactúa con un nodo distinto. Por otra parte, en el caso de las monedas FIAT como el Bolivar puedes realizar depósitos y retiros de manera tradicional. Es decir, que tu reportes el deposito o retiro y un operador se encargue de realizar la acción y validarla. Aunque, puedes hacer movimientos de manera rápida utilizando pago móvil. Esta integración permite que puedas realizar movimientos sin necesidad de terceros. AFX Trade también cuenta con mensajería por interna, SMS y correo. Así como también con doble autentificación.",
    "bsIntegration": "Depósitos y retiros tradicionales, validadas y realizadas por un operador desde el CMS.",
    "bitcoinIntegration": "Depósitos y retiros a través de un nodo privado de BTC, generación de wallets independientes, procesos automatizados y mínimo de comisión dependiendo de la blockchain de Bitcoin.",
    "petroIntegration": "Depósitos y retiros a través de una API privada de la SUNACRIP, wallet generadas a partir de una wallet central con procesos automatizados.",
    "dolarIntegration": "Depósitos y retiros tradicionales, validadas y realizadas por un operador desde el CMS.",
    "pagoMovilIntegration": "Depósitos y retiros a traves de API de Banco Plaza, los datos son validados anteriormente para porder ser usados a traves de la API. No requiere de un operador para su ejecucción.",
    "usdtIntegration": "Los movimientos se ejecutan a traves de la red de Tether. Manteniendo las comisiones a un nivel bajo. Asi como también, se manejan TRX para la creación de las wallets.",
    "etherumIntegration": "Proximamente",
    "dashIntegration": "Proximamente",
    "segurityTitle": "SEGURIDAD",
    "segurityDsc": "En el apartado de seguridad se tienen varias cosas en cuenta, al momento de hacer movimientos como transferencias, retiros, depósitos o intercambios. Así como también al momento de registrarte, la información pasa a ser validada por un operador. Todas las acciones que realizas son notificadas con un SMS o por medio de un correo electrónico siempre y cuando tengas las notificaciones activadas.",
    "comTitle": "MENSAJERÍA",
    "comDsc": "Existe una mensajería interna entre los usuarios y los operadores, que al igual que las acciones realizadas, pueden ser notificadas por SMS o correo en caso de ser necesario por los operadores. Esta comunicación esta llevada por departamentos dependiendo del problema que presente el usuario o la ayuda que necesite.",
    "movementTitle": "MOVIMIENTOS",
    "movementDsc": "Los movimientos que son generados se hacen con la mayor seguridad. Si en medio de algún movimiento algo falla, el movimiento no se crea hasta que este completado. Así como también el usuario puede ver el detalle de cada uno de los movimientos que ha realizado, la comisión que han generado y el status de estos. Al realizar un deposito o retiro pueden congelarse los montos de esos movimientos a la espera de que un operador la libere o el bloque sea confirmado. Así como también pueden ser cancelados por faltas de confirmaciones o en el caso de ser tradicional, por falta o errores de datos.",
    "exchangeTitle": "INTERCAMBIOS",
    "exchangeDsc": "A la hora de hacer un intercambio tenemos dos opciones, por medio de una orden limit o market. las ordenes limit permiten que coloques orden de compra y venta la cantidad que desees al precio que desees bajo el estándar del mercado. Mientras que, las ordenes market se ejecutan inmediatamente comprando al precio del mercado la cantidad que desees. Ambas ordenes pueden ser completadas parcialmente, en el caso de las market si no existe liquidez la orden es completada hasta el máximo de liquidez existente, mientras que las limit pueden ser completadas parcialmente dependiendo de la cantidad que compran o vendan las ordenes market. Los intercambios generan movimientos de salida y de entrada para la orden market, ordenes limit y comisiones generadas, estos movimientos se guardan a detalle permitiéndole a los usuarios conocer con exactitud como se ejecuta un intercambio.",
    "cmstitle": "CMS",
    "cmsintro1": "El CMS creado para AFX Trade contiene todo lo necesario para la administración autónoma del sitio, así como agregar monedas FIAT con métodos tradicionales de depósito y retiro. Creación de pares de intercambio, así como también las comisiones y limites de cada usuario. Este CMS cuenta con un sistema de roles y privilegios para los operadores que lo utilicen, ya sea para validar información de los usuarios, validar operaciones, monitorear intercambios, atención al cliente, y también cuenta con una auditoria para tanto el lado del cliente como el CMS para estar al tanto de las acciones que se realizan en el cliente como en el CMS.",
    "cmsintro2": "Cuenta con generación de reportes tanto en Excel como en PDF generados con PHP. Estos reportes pueden ser generados cada vez que sean necesarios.",
    "featuretitle1": "Exportación a Excel y PDF",
    "feature1": "Desde el CMS se pueden generar reportes automáticos en PDF y también se pueden generar listas de Excel de los datos que sean requeridos. Estos documentos son generados desde el backend con PHP.",
    "featuretitle2": "Endpoints optimizados",
    "feature2": "Los endpoints creados para AFX Trade cuentan con optimización de Queries, para que las consultas de datos pesados como lo son graficas, ordenes, movimientos e intercambios se ejecutaran de forma rápida para que la experiencia de usuario fuera fluida y agradable.",
    "featuretitle3": "Inserción de datos segura",
    "feature3": "En PHP existen transacciones, que te permite accionar una serie de procesos en donde, si algún proceso falla, ningún proceso de la serie es ejecutado. Estas transacciones permiten que no existan discrepancia en los datos o inserciones incompletas.",
    "featuretitle4": "Sistema de roles y privilegios",
    "feature4": "En el CMS, existen roles y privilegios que permiten realizar acciones dentro de el, diferenciándose con módulos y con acciones diferentes en cada uno. Mientras que del lado del cliente, existe un sistema de niveles y roles que hacen que las comisiones y limites del usuario sean diferentes.",
    "featuretitle5": "Integraciones únicas",
    "feature5": "Como se ha explicado en la sección de integraciones, cada criptomoneda fue integrada de manera única, no se utilizaron librerías globales o nodos globales para las criptomonedas, sino que cada una es tratada de manera individual. Al igual con procesos de transacciones como Pago Móvil.",
    "featuretitle6": "Creación de CRON",
    "feature6": "Para mantener una base de datos limpia y hacer validaciones de movimientos e intercambios. Se crearon diferentes procesos para validar transacciones entrantes, direcciones de wallets expiradas, transacciones incompletas y muchos más. Todos forman partes de distintos CRONs que se ejecutan durante un tiempo determinado."
  },
  "traumapp": {
    "dsc": "Aplicación móvil para administrar consultas médicas e historias clínicas",
    "role": "Creador / Fullstack",
    "intro1": "TraumApp es una aplicación móvil creada para agilizar consultas medicas. Permitiéndote administrar la información de pacientes, agendar citas medicas, crear informes automatizados, crear recipes con los medicamentos de tu preferencia, exportación a PDF y mucho más.",
    "intro2": "TraumApp es una aplicación que llevo trabajando de manera independiente junto con la diseñadora Magrey Touissainte.",
    "intro3": "Esta aplicación te permite gestionar tus pacientes de manera fácil y cómoda, permitiendo tener un historial clínico y una ficha medica en un solo lugar. Ademas, te permite programar tus consultas medicas, agendando pacientes a determinadas horas y marcar su hora de entrada y salida. Cuenta con un Modo Registro en el cual un administrador o los mismos pacientes pueden registrarse o marcar que asistieron a la consulta medica. También, el usuario puede asignar seguros médicos a los pacientes y medicamentos a los recipes, teniendo sus propias listas con los seguros y medicamentos con los que trabaja a menudo. Cabe destacar, el apartado de informes te permite generar de manera automatizada la historia medica de la consulta del paciente. Permitiéndole al usuario la creación de la historia de manera rápida y evitar dejarse detalles de la consulta. Así como también, esta historia medica puede ser exportada PDF o impresa por medio de Bluetooth.",
    "visualResult1": "El login es por medio de usuario(Correo) y contraseña, donde puedes ver tu contraseña en caso de ser necesario, si ya tienes una sesión activa, te enviara directo al menú principal.",
    "visualResult2": "El menú principal te permite navegar a los diversos módulos como Pacientes, Calendario y Configuración. Ademas, en el caso de que tengas pacientes agendados para el día que entres, te mostrara las citas por orden de entrada.",
    "visualResult3": "El calendario te mostrara los días que tuviste o tendrás citas programadas. Para ver las citas de un solo día debes pulsar en él y te saldrán las citas que tengas para ese día.En caso de que hayas avanzado demasiado, siempre podras volver al día de Hoy con solo pulsarlo.",
    "visualResult4": "El modo registro te permite registrar pacientes y confirmar citas medicas. Esto permite que un administrador o incluso los mismos pacientes puedan agregarse en la lista. Así como también confirmar su presencia en la cita. Por otra parte, para salir de este modo se debe hacer con un PIN de seguridad. Para evitar que otra persona ingrese como tal a la aplicación.",
    "titlePatients": "Pacientes",
    "dscPatients": "Desde este modulo, podemos administrar nuestros pacientes, permitiéndonos agregar nuevos pacientes, editar los pacientes que ya hemos ingresado, y poder ver a detalles su ficha clínica, como lo es su información personal, las historias medicas y los recipes que posee el paciente. a la hora de buscar paciente podemos filtrar por todos sus atributos, así como podemos ordenar también los registros. Para mantener esta pantalla optimizada se muestran un limite de pacientes permitiéndole al usuario seguir mostrando más pacientes en caso que lo necesite. Por otra parte, al ver la ficha del usuario, las historias y recipes pueden ser filtrados por orden o nombre que posean.",
    "registerPatients": "En el registro del paciente, tenemos datos obligatorios que son necesarios para crear su ficha personal, historias y recipes. Así como también datos extras que permiten tener una ficha más completa. Ademas, se puede relacionar un seguro medico a cada paciente que se registre.",
    "titleForms": "Informes",
    "dscForms": "El apartado de informes es el más complejo, ya que a partir de un formulario sencillo, sé crear un informe medico automatizado. En TraumApp existen diferentes formularios donde cada uno de ellos es diferente y a su vez, es diferente el informe que estos generan. Ademas estos informes pueden ser modificados en caso de ser necesario. Por otra parte, las historias pueden ser exportadas a formato PDF o solo ser guardadas en el sistema. Si el usuario posee el envió de informe automático, esto hará que se le envíe de manera automática al paciente su informe medico en caso de que lo necesite. Por otro lado, los recipes también son generados de manera automática, el usuario solo debe agregar los medicamentos y la cantidad junto con las indicaciones y este sera generado, y al igual que los informes, puede ser exportado a PDF o guardado en el sistema.",
    "titleCalendar": "Calendario",
    "dscCalendar": "En el módulo de calendario podemos tener un visión de nuestras citas programadas así como nuestras citas pasadas. Permitiéndonos ver a detalle las citas de cada día y hacer registro de citas no guardadas o citas a futuro. Este modulo permite agendar citas y relacionarlas con pacientes que ya hayamos ingresado, así como también, agregar una pequeña descripción de la cita. Dentro de la ficha de la cita, podemos enviarle una notificación al usuario vía WhatsApp informándole acerca de la cita. También, podemos cambiar el status de la cita, informando que el paciente asistió a su consulta o que no pudo asistir. Por otra parte, podemos borrar o editar las citas que hayan sido ingresadas de manera incorrecta.",
    "titleConfig": "Configuración",
    "dscConfig": "En la configuración de TraumApp tenemos múltiples funciones, desde ver y editar los datos de nuestro usuario hasta agregar registros de medicamentos y seguros médicos. También podemos contactar a soporte desde aquí permitiéndonos enviar un correo de manera sencilla. Ademas, podemos configurar lo que es el Modo Registro, agregando el PIN de seguridad para salir del Modo Registro y también podemos acceder a este modo. Donde podemos realizar acciones básicas como ingresar pacientes o confirmar citas medicas. En caso de que seamos usuarios Premiun, podremos exportar los datos de los pacientes y las citas a Excel. Así como también habilitar él envió de informes automáticos. Por otra parte, podemos activar o desactivar el Modo Oscuro, el cual solo influye de manera visual en la aplicación.",
    "userTitleConfig": "Usuario",
    "userDscConfig": "Desde la sección de usuarios podemos ver los datos que poseemos, nuestro plan e incluso cambiar la contraseña con comodidad. Ademas, podemos editar nuestra información a excepción del correo principal (usuario) y la identificación personal (DNI).",
    "medicineTitleConfig": "Medicamentos y Seguros",
    "medicineDscConfig": "Podemos tener lista de medicamentos y seguros de nuestra preferencia, permitiéndonos ingresar y usarlos en nuestros registros. En el caso de los seguros son relacionados a los pacientes. Mientras que, los medicamentos se cargan en el formulario para generarlo.",
    "registerModeTitleConfig": "Modo Registro",
    "registerModeDscConfig": "El modo registro permite que el usuario pueda dar su dispositivo para que el paciente o un administrador realicen acciones básicas como registrar pacientes o confirmar asistencia a la cita medica del día.",
    "principalFeatures": "Características principales",
    "resume": "Es una aplicación móvil multiplataforma desarrollada con React Native. Cuenta con una interfaz comoda para el usuario y mejorar su uso diario. Creada para optimizar una consulta medica y el manejo de la informacion de los pacientes."
  },
  "knowlegde": {
    "firstDsc":"Estoy muy familiarizado usando tecnologías web como HTML5, CSS3, TypeScript y JavaScript bajo el estándar ECMAScript desde la versión 6 hasta la versión 11.",
    "secondDsc":"Ademas, he trabajado en el Front-end con frameworks como Angular y React con sus librería como Material UI y Angular Material. Cuento con experiencia creando páginas web responsivas con un alto rendimiento.",
    "thirdDsc":"Por otra parte, estoy familiarizado usando el framework React Native para crear aplicaciones móviles multiplataforma. También, Electron en el caso de aplicaciones para escritorio multiplataforma.",
    "quarterDsc":"Sin embargo, en el Back-end he usado PHP y Java para la creación de REST API, usando bases de datos tanto SQL y NoSQL. Como MySQL, PostgreSQL, MongoDB, Realm y Firebase.",
    "fiftDsc":"Adicionalmente, he trabajo bajo metodologías SCRUM y Kanban con herramientas como Trello, Jira, Slack y Confluence. Ademas, tengo conocimiento en herramientas visuales como Figma, Zeplin, MarvelApp y Mockflow."
  },
  "about":{
    "resume":"Soy un desarrollador web y móvil venezolano.<br>Realmente me gusta crear productos útiles e intuitivos con interfaces visuales cómodas para todos.",
    "aboutLink":"Leer más sobre mí",
    "welcome": "Hola!",
    "intro": "Mi nombre es Samuel.<br>Soy un desarrollador web y móvil actualmente trabajo como programador independiente, me encuentro en Caracas, Venezuela.",
    "whatILike": "Realmente me gusta hacer productos útiles e intuitivos con interfaces visuales cómodas para cualquier persona. Me gusta analizar el contexto del usuario para crear la mejor solución en cada proyecto. Tengo experiencia haciendo aplicaciones multiplataforma y trabajando como desarrollador fullstack en diversos proyectos. Construyendo páginas web responsivas y creando REST API.",
    "tec": "Estoy muy familiarizado utilizando HTML5, CSS3, TypeScript y JavaScript. Del lado del Front-end he utilizado frameworks como Angular y React para páginas web, React Native para aplicaciones móviles y Electron para aplicaciones de escritorio. Por otra parte, en el Backend he trabajado mayormente utilizando PHP para la creación de servicios web REST API, aunque también tengo experiencia usando Java. He trabajado con bases de datos relacionales y bases de datos no relacionales. Siendo MySQL y Firebase los motores con los que más he trabajado. También, he trabajado con Realm, PostgreSQL y MongoDB.",
    "keepingUp": "Para mantenerme siempre actualizado, realizo cursos, leo documentación actualizada, veo conferencias y veo videos de Youtube para aprender sobre nuevas tecnologías.",
    "contact": "Si tienes un proyecto, si estás interesado en una colaboración o simplemente quieres saludar, no dudes en enviarme un correo electrónico a contact@samueldear.com.",
    "spam": "También puedes saber más sobre mí aquí:"
  },
  "slideMenu":{
    "homeLink": "INICIO",
    "projectsLink": "PROYECTOS",
    "knowlegdeLink": "CONOCIMIENTOS",
    "whoDesigned": "¿QUIÉN DISEÑO ESTO?",
    "aboutLink": "ACERCA DE MÍ",
    "studies": "ESTUDIOS"
  },
  "project": {
    "role": "Rol:",
    "agency": "Empresa:",
    "date": "Fecha:",
    "introTitle": "Introducción",
    "visualRes": "Resultado Visual",
    "typoColor": "Tipografía - Color",
    "features": "Características",
    "thanks": "Gracias por leer!",
    "hereMore": "Aquí puede saber más ",
    "aboutLink": "acerca de mí",
    "otherWork": "Puedes ver mis otros trabajos!"
  }
}
