{
  "header": {
    "aboutButton": "SOBRE MI"
  },
  "home": {
    "presentation": "Hola! Mi nombre es Samuel Rojas.",
    "description": " Soy un diseñador web y desarrollador movil que hace paginas web responsivas y desarrolla aplicaciones moviles multiplataforma.",
    "linkProject": "Mirar Proyecto"
  },
  "myWeb": {
    "resume": "Es un sitio web de pagina unica(SPA). Con un alto rendimiento, un sitio web responsivo que utiliza animaciones potentes. Tambien, usa el poder de los SVG para enriquecer la experiencia del usuario.",
    "dsc": "Mi propio sitio web donde enseño las cosas que hago",
    "agency": "Proyecto Personal",
    "role": "Dueño/Desarrollador",
    "intro": "El diseño de mi portafolio fue hecho por mi mismo, desde el inicio queria que fuera un sitio web en modo oscuro, ya que no soy muy fanatico del modo claro. Tambien, que contara con animaciones sencillas para no saturar la experiencia del usuario.",
    "intro2": "Durante el desarrollo se fueron agregando detalles que no estaban en el punto inicial para hacer una experiencia mas fluida. Un sitio web que aprovecha el uso de SVGs para un mejor renderizado y de una navegacion sencilla para un mejor flujo en la pagina web.",
    "feature1title": "Diseño Web Responsivo",
    "feature1": "El diseño de la pagina es escalable a dispositivos moviles y a cualquier resolucion, comportandose de manera eficiente en cualquier dispositivo y permitiendo que cualquier usuario pueda disfrutar de la pagina web.",
    "feature2title": "Uso de SVGs",
    "feature2": "La pagina web cuenta con imagenes SVG para mejorar los tiempos de cargas y que la descarga sea mas eficiente. Tambien, para que la calidad de las imagenes sea la misma en cualquier pantalla.",
    "feature3title": "Animaciones Sencillas",
    "feature3": "Cada detalle de la pagina cuenta con una animacion sencilla para no sobrecargar el sitio con animaciones. Es por ello que cuenta con animaciones sencillas estilo fade-out, fade-in y slide.",
    "feature4title": "Transición interactiva",
    "feature4": "Para la navegacion entre pantallas, se creo una transicion sencilla para una mejor experiencia a la hora de navegar entre las pantallas. Tambien, a la hora de navegar puedes determinar donde te encuentras por la forma del hamburguer-menu.",
    "feature5title": "Diseño Web Amigable",
    "feature5": "La paleta de colores es bastante sencilla, ya que el tema principal es modo oscuro. Cuenta con colores sencillos y elementos sencillos para que sea un sitio amigable.",
    "feature6title": "Acerca de la página",
    "feature6": "Para mostrar las redes sociales, decidi colocar un pie de pagina en el que se pudieran visualizar de mejor manera, igual al momento de ver mas sobre mi, puedes encontrar mi redes sociales.",
    "feature7title": "Diseño Personalizado Para Cada Proyecto",
    "feature7": "Cada pagina de un proyecto, tiene elementos personalizados para que los detalles de los proyectos puedan ser mejor apreciados."
  },
  "orm": {
    "resume": "Es una pagina web creada con HTML5, CSS3, JS y PHP. un sitio web responsivo con un diseño comodo para facilitar la experiencia del usuario y de un alto rendimiento. Creado para facilitar a los colegios de Venezuela la inscripcion a las Olimpiadas Recreativas de Matematicas.",
    "dsc": "Pagina Web para la administración de las Olimpiadas Recreativas de Matematicas de Venezuela",
    "role": "Frontend/Backend",
    "intro": "Las Olimpíadas Recreativas de Matemáticas de Venezuela es un evento con el objetivo de Desarrollar estrategias para la enseñanza de La Matemática, mejorar el nivel académico y estimular en los niños el uso de sus capacidades intelectuales: comprensión, capacidad de síntesis y juicio crítico.",
    "intro2": "En las Olimpiadas Recreativas de Matematicas se inscriben una gran cantidad de colegios los cuales inscriben una gran cantidad de alumnos, el objetivo principal del sitio web, es el de permitirle a los colegios registrar y administrar sus participantes, tambien permite que los organizadores de las olimpiadas puedan tener una administracion optima de toda la informacion de el evento, como los datos de los colegios, alumnos y examenes.",
    "feature1title": "Diseño Web Responsivo",
    "feature1": "La pagina web puede ser visualizada en cualquier dispositivo y seguir comportandose de manera eficiente en dispositivos moviles.",
    "feature2title": "CMS",
    "feature2": "Para administrar la informacion de los colegios, alumnos y examenes, se desarrollo un Content Managment System, con la finalidad de que la informacion se pueda visualizar, crear, editar o borrar la informacion. Tambien cuenta con un sistema de privilegios para que existan diversos roles dentro de la administracion. Tambien, este permite hacer correcciones manuales de los examenes en caso de que el sistema no haya podido identificar a que participante pertenece.",
    "feature3title": "Uso de SVGs",
    "feature3": "Para las imagenes dentro de la pagina web se usaron SVGs para mejorar los tiempos de carga, asi como tambien diversos elementos fueron hechos con CSS puro.",
    "feature4title": "Exportacion a Excel",
    "feature4": "Tanto la pagina web como el CMS permiten exportar datos a Excel, en el caso de el sitio web, los colegios pueden exportar listas con sus participantes, igual que en el CMS pueden ser exportados las respuestas de los examenes.",
    "feature5title": "Solicitudes HTTP reducidas",
    "feature5": "Las solicitudes al servidor se encuentran reducidas para mejorar los tiempos de carga en los casos de las listas largas de informacion como pueden ser las listas de participantes.",
    "feature6title": "Exportaciones de gran tamaño con Zip",
    "feature6": "En el caso de descargar una gran cantidad de informacion, como puede ser la lista de participantes en total, estos pueden ser mas de 10.000, para mejorar los tiempos de descarga de los paquetes."
  },
  "fjcintranet": {
    "resume": "Es un sistema interno de pagina unica(SPA). Creado con Angular 8 y Java Spring, para la gestion documental y de hallazgos en la Fundacion Jacinto Convit. Un sitio web que cuenta con estandares internacionales y bajo el estandar ISO 9001.",
    "role": "Lider/Frontend/Backend",
    "dsc": "Sistema interno para procesos de gestion documental y de hallazgos",
    "intro": "La Fundación Jacinto Convit (FJC) es una institución sin fines de lucro, que preserva, protege y continúa la obra, proyectos, valores y filosofía del médico, científico y humanista Dr. Jacinto Convit.",
    "intro2": "Debido a la gran cantidad de documentos que maneja la fundacion, el objetivo principal del sistema interno que logramos fue mejorar la gestion de grandes cantidades de documentos. Tambien, la fundacion al contar con la licencia de ISO 9001 debe cumplir con ciertos criterios de calidad, es por ello que el sistema interno cuenta con la gestion de estos procesos tanto para resolucion de problemas como para auditorias de los mismos. La Fundacion Jacinto Convit cuenta con sedes en Venezuela y en Estados Unidos, es por ellos que el sistema fue desarrollado en dos lenguajes, ingles y español.",
    "feature1title": "CMS",
    "feature1": "El sistema cuenta con un Content Managment System para monitorear el sistema interno, este cuenta con la posibilidad de visualizar, crear, editar o eliminar cualquier tipo de informacion que tenga el sistema ingresado. Teniendo a su vez apartado para monitorear las actividades de los usuarios y limitarlas.",
    "feature2title": "Alto Rendimiento",
    "feature2": "El sistema cuenta con un gran rendimiento gracias al uso de Java Spring Boot, el cual permite manejar informacion en cache para mejorar cargas. Tambien, su gran velocidad se debe a la sencillez de la informacion que es requeridad para cada proceso.",
    "feature3title": "Creación de Documentos",
    "feature3": "El modulo de gestion documental permite a los usuarios crear documentos tanto de Word como de Excel, tambien permite guardar otros tipos de archivos que sean necesarios. Las plantillas pueden ser cargadas desde el CMS",
    "feature4title": "Calendario con Notificaciones",
    "feature4": "El calendario fue creado para organizar las actividades dentro de la fundacion, como reuniones o eventos, permiten llevar tambien un control con las tareas que deben hacer en los hallazgos para la resolucion de estos.",
    "feature5title": "Multi-idioma",
    "feature5": "El sistema se encuentra tanto en ingles como en español, debido a que la institucion cuenta con diferentes sedes en el mundo, es por ello que esta informacion debe contrarse en ambos idiomas para un mejor uso y una mejor experiencia de usuario."
  },
  "traumapp": {
    "resume": "Es una aplicación móvil multiplataforma desarrollada con React Native. Cuenta con una interfaz comoda para el usuario y mejorar su uso diario. Creada para optimizar una consulta medica y el manejo de la informacion de los pacientes."
  },
  "knowlegde": {
    "firstDsc":"Estoy muy familiarizado usando tecnologias web como HTML5, CSS3 y JavaScript. Y tambien he usado frameworks como Angular y React.",
    "secondDsc":"Tengo experiencia usando ES6, ES7 y TypeScript. Ademas, cuento con experiencia creando paginas web responsivas con un alto rendimiento.",
    "thirdDsc":"Por otra parte, Estoy familiarizado usando el framework React Native para crear aplicaciones moviles multiplataforma.",
    "quarterDsc":"Sin embargo, en el Back-end he usado PHP y Java, usando bases de datos tanto SQL y NoSQL. Como MySQL, PostgreSQL, MongoDB, Realm y Firebase."
  },
  "about":{
    "resume":"Soy un diseñador web y desarrollador movil Venezolano.<br>Realmente me gusta crear productos utiles e intuitivos con interfaces visuales comodas para todos.",
    "aboutLink":"Leer mas sobre mi",
    "welcome": "Hola!",
    "intro": "Mi nombre es Samuel.<br>Soy un diseñador web y desarrollador movil actualmente trabajo como programador independiente, me encuentro en Caracas, Venezuela.",
    "whatILike": "Realmente me gusta hacer productos útiles e intuitivos con interfaces visuales cómodas para cualquier persona. Me gusta analizar el contexto del usuario para crear la mejor solución en cada proyecto. Tengo experiencia haciendo aplicaciones multiplataforma y trabajando como desarrollador front-end en algunos proyectos. también, he construido paginas web responsivas.",
    "tec": "Aunque estoy muy familiarizado con los marcos de trabajo como React Native, React y Angular para el desarrollo de aplicaciones, la mayoria de los sitios web que he desarrollado fueron codificados principalmente a mano con HTML5, CCS3, JavaScript y PHP.",
    "keepingUp": "Para mantenerme siempre actualizado, leo libros, leo documentación actualizada, veo conferencias y veo videos de Youtube para aprender sobre nuevas tecnologías.",
    "contact": "Si tienes un proyecto, si estás interesado en una colaboración o simplemente quieres saludar, no dudes en enviarme un correo electrónico a samuel_dear@hotmail.com.",
    "spam": "También puedes saber más sobre mí aquí:"
  },
  "slideMenu":{
    "homeLink": "INICIO",
    "projectsLink": "PROYECTOS",
    "knowlegdeLink": "CONOCIMIENTOS",
    "whoDesigned": "¿QUIEN DISEÑO ESTO?",
    "aboutLink": "ACERCA DE MI",
    "studies": "ESTUDIOS"
  },
  "project": {
    "role": "Rol:",
    "agency": "Empresa:",
    "date": "Fecha:",
    "introTitle": "Introducción",
    "visualRes": "Resultado Visual",
    "typoColor": "Tipografia - Color",
    "features": "Caracteristicas",
    "thanks": "Gracias por leer!",
    "hereMore": "Aqui puede saber mas ",
    "aboutLink": "acerca de mi",
    "otherWork": "Puedes ver mis otros trabajos!"
  }
}
