{
  "copy": "© 2021, Todos los derechos reservados.",
  "header": {
    "aboutButton": "SOBRE MÍ"
  },
  "home": {
    "presentation": "Hola! Mi nombre es Samuel Rojas.",
    "description": "Soy un desarrollador web y móvil que hace páginas web responsivas y desarrolla aplicaciones móviles multiplataforma.",
    "linkProject": "Mirar Proyecto",
    "msgContact": "Siéntete libre de enviarme un correo a",
    "submsgContact": "O puedes enviarme un correo desde aquí!",
    "labelName": "Nombre",
    "labelEmail": "Correo",
    "labelDscEmail": "Mensaje",
    "btnText": "Enviar",
    "requiredInput": "Este campo es obligatorio.",
    "invalidEmail": "Correo invalido."
  },
  "knowlegde": {
    "firstDsc":"Estoy muy familiarizado usando tecnologías web como HTML5, CSS3, TypeScript y JavaScript bajo el estándar ECMAScript desde la versión 6 hasta la versión 11.",
    "secondDsc":"Ademas, he trabajado en el Front-end con frameworks como Angular y React con sus librería como Material UI y Angular Material. Cuento con experiencia creando páginas web responsivas con un alto rendimiento.",
    "thirdDsc":"Por otra parte, estoy familiarizado usando el framework React Native para crear aplicaciones móviles multiplataforma. También, Electron en el caso de aplicaciones para escritorio multiplataforma.",
    "quarterDsc":"Sin embargo, en el Back-end he usado PHP y Java para la creación de REST API, usando bases de datos tanto SQL y NoSQL. Como MySQL, PostgreSQL, MongoDB, Realm y Firebase.",
    "fiftDsc":"Adicionalmente, he trabajo bajo metodologías SCRUM y Kanban con herramientas como Trello, Jira, Slack y Confluence. Ademas, tengo conocimiento en herramientas visuales como Figma, Zeplin, MarvelApp y Mockflow."
  },
  "about":{
    "resume":"Soy un desarrollador web y móvil venezolano.<br>Realmente me gusta crear productos útiles e intuitivos con interfaces visuales cómodas para todos.",
    "aboutLink":"Leer más sobre mí",
    "welcome": "Hola!",
    "intro": "Mi nombre es Samuel.<br>Soy un desarrollador web y móvil actualmente trabajo como programador independiente, me encuentro en Caracas, Venezuela.",
    "whatILike": "Realmente me gusta hacer productos útiles e intuitivos con interfaces visuales cómodas para cualquier persona. Me gusta analizar el contexto del usuario para crear la mejor solución en cada proyecto. Tengo experiencia haciendo aplicaciones multiplataforma y trabajando como desarrollador fullstack en diversos proyectos. Construyendo páginas web responsivas y creando REST API.",
    "tec": "Estoy muy familiarizado utilizando HTML5, CSS3, TypeScript y JavaScript. Del lado del Front-end he utilizado frameworks como Angular y React para páginas web, React Native para aplicaciones móviles y Electron para aplicaciones de escritorio. Por otra parte, en el Backend he trabajado mayormente utilizando PHP para la creación de servicios web REST API, aunque también tengo experiencia usando Java. He trabajado con bases de datos relacionales y bases de datos no relacionales. Siendo MySQL y Firebase los motores con los que más he trabajado. También, he trabajado con Realm, PostgreSQL y MongoDB.",
    "keepingUp": "Para mantenerme siempre actualizado, realizo cursos, leo documentación actualizada, veo conferencias y veo videos de Youtube para aprender sobre nuevas tecnologías.",
    "contact": "Si tienes un proyecto, si estás interesado en una colaboración o simplemente quieres saludar, no dudes en enviarme un correo electrónico a contact@samueldear.com.",
    "spam": "También puedes saber más sobre mí aquí:"
  },
  "project": {
    "role": "Rol:",
    "agency": "Empresa:",
    "date": "Fecha:",
    "introTitle": "Introducción",
    "visualRes": "Resultado Visual",
    "typoColor": "Tipografía - Color",
    "features": "Características",
    "thanks": "Gracias por leer!",
    "hereMore": "Aquí puede saber más ",
    "aboutLink": "acerca de mí",
    "otherWork": "Puedes ver mis otros trabajos!",
    "visitProject": "Visitar"
  }
}
