{
  "traumapp": {
    "dsc": "Mobile application to manage medical consultations and medical records",
    "role": "Creator / Fullstack",
    "intro1": "TraumApp is a mobile application created to speed up medical consultations. Allowing you to manage patient information, schedule medical appointments, create automated reports, create recipes with the medications of your choice, export to PDF and much more.",
    "intro2": "TraumApp is an application that I have been working independently together with the designer <a href='https://www.linkedin.com/in/magreyt/' target='_blank'>Magrey Touissainte</a>.",
    "intro3": "This application allows you to manage your patients in an easy and comfortable way, allowing you to have a clinical history and a medical file in one place. In addition, it allows you to schedule your medical consultations, scheduling patients at certain times and marking their time of entry and exit. It has a Register Mode in which an administrator or the patients themselves can register or mark that they attended the medical consultation. Also, the user can assign medical insurances to patients and medicines to recipes, having his own lists with the insurances and medicines with which the user often works. It should be noted, the reports section allows you to automatically generate the medical history of the patient's consultation. Allowing the user to create the story quickly and avoid leaving details of the query. As well as, this medical history can be exported PDF or printed via Bluetooth.",
    "visualResult1": "The login is through username (Email) and password, where you can see your password if necessary, if you already have an active session, it will send you directly to the main menu.",
    "visualResult2": "The main menu allows you to navigate to the various modules such as Patients, Calendar and Settings. Also, in the event that you have patients scheduled for the day you enter, it will show you the appointments in order of entry.",
    "visualResult3": "The calendar will show you the days you had or will have scheduled appointments. To see the appointments for a single day you must click on it and the appointments you have for that day will appear. In case you have advanced too much, you can always return to Today by simply pressing it.",
    "visualResult4": "The register mode allows you to register patients and confirm medical appointments. This allows an administrator or even the patients themselves to be added to the list. As well as confirming your presence at the appointment. On the other hand, to exit this mode it must be done with a security PIN. To prevent another person from entering the application as such.",
    "titlePatients": "Patients",
    "dscPatients": "From this module, we can manage our patients, allowing us to add new patients, edit the patients that we have already entered, and be able to see their clinical file in detail, such as their personal information, medical records and recipes that the patient has. When searching for a patient, we can filter by all their attributes, as well as order the records. To keep this screen optimized, a limit of patients is shown, allowing the user to continue showing more patients in case they need it. On the other hand, when viewing the user's file, the stories and recipes can be filtered by order or name they have.",
    "registerPatients": "In the patient's registry, we have mandatory data that is necessary to create their personal file, histories and recipes. As well as extra data that allow you to have a more complete file. In addition, a medical insurance can be linked to each patient who registers.",
    "titleForms": "Reports",
    "dscForms": "The reports section is the most complex, since from a simple form, user can create an automated medical report. In TraumApp there are different forms where each of them is different and, in turn, the report they generate is different. In addition, these reports can be modified if necessary. On the other hand, the stories can be exported to PDF format or only be saved in the system. If the user has the automatic report sending, this will automatically send their medical report to the patient in case they need it. On the other hand, the recipes are also generated automatically, the user only has to add the medications and the quantity along with the indications and this will be generated, and like the reports, it can be exported to PDF or saved in the system.",
    "titleCalendar": "Calendar",
    "dscCalendar": "In the calendar module we can have a view of our scheduled appointments as well as our past appointments. Allowing us to see in detail the appointments of each day and make a record of unsaved appointments or future appointments. This module allows you to schedule appointments and relate them to patients that we have already entered, as well as add a short description of the appointment. Within the appointment file, we can send a notification to the user via WhatsApp informing him about the appointment. Also, we can change the status of the appointment, informing that the patient attended his consultation or that he could not attend. On the other hand, we can delete or edit the appointments that have been entered incorrectly.",
    "titleConfig": "Configuration",
    "dscConfig": "In the TraumApp configuration we have multiple functions, from viewing and editing our user's data to adding medication and health insurance records. We can also contact support from here allowing us to send an email easily. In addition, we can configure what the Register Mode is, adding the security PIN to exit the Register Mode and we can also access this mode. Where we can perform basic actions such as admitting patients or confirming medical appointments. In case we are Premium users, we can export patient data and appointments to Excel. As well as enabling him to send automatic reports. On the other hand, we can activate or deactivate the Dark Mode, which only visually influences the application.",
    "userTitleConfig": "User",
    "userDscConfig": "From the users section we can see the data we have, our plan and even change the password with ease. In addition, we can edit our information except for the main email (user) and personal identification (DNI).",
    "medicineTitleConfig": "Medications and Insurance",
    "medicineDscConfig": "We can have a list of medications and insurance of our preference, allowing us to enter and use them in our records. In the case of insurance, they are related to patients. Whereas, the drugs are loaded into the form to generate it.",
    "registerModeTitleConfig": "Reguster Mode",
    "registerModeDscConfig": "The register mode allows the user to give their device so that the patient or an administrator can perform basic actions such as registering patients or confirming attendance at the day's medical appointment.",
    "principalFeatures": "Principal Features",
    "principalFeatureTitle1": "Data export",
    "principalFeatureDsc1": "The PDFs that are generated in the creation of medical reports are generated in a unique and fast way. allowing the user to manipulate them without any problem. As well as the printing of these. Moreover, the export of patient or appointment data to Excel. Allowing the user to monitor the data that is necessary.",
    "principalFeatureTitle2": "Multiple forms",
    "principalFeatureDsc2": "In the reports section, there are multiple forms, each of which is different. This allows the generation of medical reports to be more detailed. Each form is centered on a body part, allowing you to enter details of the body part you are evaluating.",
    "principalFeatureTitle3": "Digitization",
    "principalFeatureDsc3": "Notebooks, sheets and folders are still used in many medical offices to carry personal files and medical records of patients. With TraumApp, the records and processes that a medical office needs are digitized.",
    "featureTitle1": "Multiplatform technology",
    "featureDsc1": "Although it is currently only available in the Play Store. React Native allows you to compile applications also for iOS, therefore, it could be published in the iOS App Store.",
    "featureTitle2": "Report automation",
    "featureDsc2": "The forms were created in detail so that their creation was automatic and efficient. This allows for a standard in medical reports and greater agility when creating a report.",
    "featureTitle3": "Users and privileges",
    "featureDsc3": "There are different levels of users who can perform different actions between them, from exporting data to Excel to automating the sending of reports",
    "featureTitle4": "Report notification by mail",
    "featureDsc4": "After having completed a report, it can be automatically sent to the patient who was made, thus allowing the patient to have their own medical report if necessary.",
    "featureTitle5": "Dark Mode",
    "featureDsc5": "If you got this far, you could realize that TraumApp has a light design and a dark design, which can be activated whenever the user wants. Both designs are carefully created to maintain a good color harmony.",
    "resume": "It is a multiplatform mobile application developed with React Native. It has a comfortable interface for the user and improve its daily use. Created to optimize a medical consultation and the management of patient information."
  },
  "project": {
    "role": "Role:",
    "agency": "Agency:",
    "date": "Date:",
    "introTitle": "Introduction",
    "visualRes": "Visual Result",
    "typoColor": "Typography - Color",
    "features": "Features",
    "thanks": "Thanks for Watching!",
    "hereMore": "Here you can know more ",
    "aboutLink": "about me",
    "otherWork": "You can see my other works!",
    "visitProject": "Visit"
  }
}
