{
  "traumapp": {
    "dsc": "Aplicación móvil para administrar consultas médicas e historias clínicas",
    "role": "Creador / Fullstack",
    "intro1": "TraumApp es una aplicación móvil creada para agilizar consultas medicas. Permitiéndote administrar la información de pacientes, agendar citas medicas, crear informes automatizados, crear recipes con los medicamentos de tu preferencia, exportación a PDF y mucho más.",
    "intro2": "TraumApp es una aplicación que llevo trabajando de manera independiente junto con la diseñadora <a href='https://www.linkedin.com/in/magreyt/' target='_blank'>Magrey Tousaintte</a>.",
    "intro3": "Esta aplicación te permite gestionar tus pacientes de manera fácil y cómoda, permitiendo tener un historial clínico y una ficha medica en un solo lugar. Ademas, te permite programar tus consultas medicas, agendando pacientes a determinadas horas y marcar su hora de entrada y salida. Cuenta con un Modo Registro en el cual un administrador o los mismos pacientes pueden registrarse o marcar que asistieron a la consulta medica. También, el usuario puede asignar seguros médicos a los pacientes y medicamentos a los recipes, teniendo sus propias listas con los seguros y medicamentos con los que trabaja a menudo. Cabe destacar, el apartado de informes te permite generar de manera automatizada la historia medica de la consulta del paciente. Permitiéndole al usuario la creación de la historia de manera rápida y evitar dejarse detalles de la consulta. Así como también, esta historia medica puede ser exportada PDF o impresa por medio de Bluetooth.",
    "visualResult1": "El login es por medio de usuario(Correo) y contraseña, donde puedes ver tu contraseña en caso de ser necesario, si ya tienes una sesión activa, te enviara directo al menú principal.",
    "visualResult2": "El menú principal te permite navegar a los diversos módulos como Pacientes, Calendario y Configuración. Ademas, en el caso de que tengas pacientes agendados para el día que entres, te mostrara las citas por orden de entrada.",
    "visualResult3": "El calendario te mostrara los días que tuviste o tendrás citas programadas. Para ver las citas de un solo día debes pulsar en él y te saldrán las citas que tengas para ese día. En caso de que hayas avanzado demasiado, siempre podras volver al día de Hoy con solo pulsarlo.",
    "visualResult4": "El modo registro te permite registrar pacientes y confirmar citas medicas. Esto permite que un administrador o incluso los mismos pacientes puedan agregarse en la lista. Así como también confirmar su presencia en la cita. Por otra parte, para salir de este modo se debe hacer con un PIN de seguridad. Para evitar que otra persona ingrese como tal a la aplicación.",
    "titlePatients": "Pacientes",
    "dscPatients": "Desde este modulo, podemos administrar nuestros pacientes, permitiéndonos agregar nuevos pacientes, editar los pacientes que ya hemos ingresado, y poder ver a detalles su ficha clínica, como lo es su información personal, las historias medicas y los recipes que posee el paciente. A la hora de buscar paciente podemos filtrar por todos sus atributos, así como podemos ordenar también los registros. Para mantener esta pantalla optimizada se muestran un limite de pacientes permitiéndole al usuario seguir mostrando más pacientes en caso que lo necesite. Por otra parte, al ver la ficha del usuario, las historias y recipes pueden ser filtrados por orden o nombre que posean.",
    "registerPatients": "En el registro del paciente, tenemos datos obligatorios que son necesarios para crear su ficha personal, historias y recipes. Así como también datos extras que permiten tener una ficha más completa. Ademas, se puede relacionar un seguro medico a cada paciente que se registre.",
    "titleForms": "Informes",
    "dscForms": "El apartado de informes es el más complejo, ya que a partir de un formulario sencillo, sé crear un informe medico automatizado. En TraumApp existen diferentes formularios donde cada uno de ellos es diferente y a su vez, es diferente el informe que estos generan. Ademas estos informes pueden ser modificados en caso de ser necesario. Por otra parte, las historias pueden ser exportadas a formato PDF o solo ser guardadas en el sistema. Si el usuario posee el envió de informe automático, esto hará que se le envíe de manera automática al paciente su informe medico en caso de que lo necesite. Por otro lado, los recipes también son generados de manera automática, el usuario solo debe agregar los medicamentos y la cantidad junto con las indicaciones y este sera generado, y al igual que los informes, puede ser exportado a PDF o guardado en el sistema.",
    "titleCalendar": "Calendario",
    "dscCalendar": "En el módulo de calendario podemos tener un visión de nuestras citas programadas así como nuestras citas pasadas. Permitiéndonos ver a detalle las citas de cada día y hacer registro de citas no guardadas o citas a futuro. Este modulo permite agendar citas y relacionarlas con pacientes que ya hayamos ingresado, así como también, agregar una pequeña descripción de la cita. Dentro de la ficha de la cita, podemos enviarle una notificación al usuario vía WhatsApp informándole acerca de la cita. También, podemos cambiar el status de la cita, informando que el paciente asistió a su consulta o que no pudo asistir. Por otra parte, podemos borrar o editar las citas que hayan sido ingresadas de manera incorrecta.",
    "titleConfig": "Configuración",
    "dscConfig": "En la configuración de TraumApp tenemos múltiples funciones, desde ver y editar los datos de nuestro usuario hasta agregar registros de medicamentos y seguros médicos. También podemos contactar a soporte desde aquí permitiéndonos enviar un correo de manera sencilla. Ademas, podemos configurar lo que es el Modo Registro, agregando el PIN de seguridad para salir del Modo Registro y también podemos acceder a este modo. Donde podemos realizar acciones básicas como ingresar pacientes o confirmar citas medicas. En caso de que seamos usuarios Premiun, podremos exportar los datos de los pacientes y las citas a Excel. Así como también habilitar él envió de informes automáticos. Por otra parte, podemos activar o desactivar el Modo Oscuro, el cual solo influye de manera visual en la aplicación.",
    "userTitleConfig": "Usuario",
    "userDscConfig": "Desde la sección de usuarios podemos ver los datos que poseemos, nuestro plan e incluso cambiar la contraseña con comodidad. Ademas, podemos editar nuestra información a excepción del correo principal (usuario) y la identificación personal (DNI).",
    "medicineTitleConfig": "Medicamentos y Seguros",
    "medicineDscConfig": "Podemos tener lista de medicamentos y seguros de nuestra preferencia, permitiéndonos ingresar y usarlos en nuestros registros. En el caso de los seguros son relacionados a los pacientes. Mientras que, los medicamentos se cargan en el formulario para generarlo.",
    "registerModeTitleConfig": "Modo Registro",
    "registerModeDscConfig": "El modo registro permite que el usuario pueda dar su dispositivo para que el paciente o un administrador realicen acciones básicas como registrar pacientes o confirmar asistencia a la cita medica del día.",
    "principalFeatures": "Características principales",
    "principalFeatureTitle1": "Exportación de datos",
    "principalFeatureDsc1": "Los PDFs que son generados en la creación de informes médicos se generan de manera única y rápida. Permitiéndole al usuario poder manipularlos sin ningún problema. Así como también la impresión de estos. Por otra parte, la exportación de datos de pacientes o citas a Excel.  Permitiéndole al usuario monitorear los datos que sean necesarios.",
    "principalFeatureTitle2": "Multiples formularios",
    "principalFeatureDsc2": "En el apartado de informes, existen múltiples formularios los cuales son distintos cada uno de ellos. Esto permite que la generación de informes médicos sea más detallada. Cada formulario está centrado en una parte del cuerpo, permitiéndole ingresar detalles de la parte del cuerpo que este evaluando.",
    "principalFeatureTitle3": "Digitalización",
    "principalFeatureDsc3": "En muchos consultorios médicos se siguen usando libretas, hojas y carpetas para llevar las fichas personales e historias medicas de los pacientes. Con TraumApp se digitalizan los registros y procesos que necesita un consultorio medico.",
    "featureTitle1": "Tecnología multiplataforma",
    "featureDsc1": "A pesar de que actualmente solo se encuentra disponible en la Play Store. React Native permite compilar aplicaciones también para iOS, por lo tanto, podría ser publicada en la App Store de iOS.",
    "featureTitle2": "Automatización de informes",
    "featureDsc2": "Los formularios fueron creados detalladamente para que la creación de estos fuera automática y eficiente. Esto permite que se tenga un estándar en los informes médicos y una mayor agilidad al momento de crear un informe.",
    "featureTitle3": "Usuarios y privilegios",
    "featureDsc3": "Existen diferentes niveles de usuarios que pueden realizar acciones distintas entre ellos, desde exportar datos a Excel hasta automatizar envió de informes.",
    "featureTitle4": "Notificación de informe por correo",
    "featureDsc4": "Luego de haber finalizado un informe, este puede ser enviado de manera automática hacia el paciente que se le realizo, permitiéndole así al paciente tener su propio informe medico en caso de que sea necesario.",
    "featureTitle5": "Modo Oscuro",
    "featureDsc5": "Si llegaste hasta aquí pudiste darte cuenta de que, TraumApp cuenta con diseño claro y un diseño oscuro, el cual puede activarse cuando el usuario quiera. Ambos diseños se encuentran detalladamente creados para mantener una buena armonía de colores.",
    "resume": "Es una aplicación móvil multiplataforma desarrollada con React Native. Cuenta con una interfaz comoda para el usuario y mejorar su uso diario. Creada para optimizar una consulta medica y el manejo de la informacion de los pacientes."
  },
  "project": {
    "role": "Rol:",
    "agency": "Empresa:",
    "date": "Fecha:",
    "introTitle": "Introducción",
    "visualRes": "Resultado Visual",
    "typoColor": "Tipografía - Color",
    "features": "Características",
    "thanks": "Gracias por leer!",
    "hereMore": "Aquí puede saber más ",
    "aboutLink": "acerca de mí",
    "otherWork": "Puedes ver mis otros trabajos!",
    "visitProject": "Visitar"
  },
  "orm": {
    "resume": "Es una página web creada con HTML5, CSS3, JS y PHP. Un sitio web responsivo con un diseño cómodo para facilitar la experiencia del usuario y de un alto rendimiento. Creado para facilitar a los colegios de Venezuela la inscripción a las Olimpiadas Recreativas de Matemáticas."
  },
  "traumappLanding": {
    "resume": "Es una página web desarrollada con React. Con un diseño web responsivo para cualquier dispositivo y animaciones sencillas para una mejor experiencia visual. Creada como página informativa de la aplicación TraumApp con una documentación detallada, compra de membresías y dashboard para el usuario."
  },
  "myWeb": {
    "resume": "Es un sitio web de página única(SPA). Con un alto rendimiento, un sitio web responsivo que utiliza animaciones potentes. También, usa el poder de los SVG para enriquecer la experiencia del usuario."
  }
}
