{
  "traumappWeb": {
    "dsc": "System for administration of medical consultations",
    "role": "Creator/Fullstack",
    "intro1": "TraumApp is a system created to streamline medical consultations. Allowing you to manage patient information, schedule medical appointments, create automated reports, create prescriptions with the medications of your choice, export to PDF and much more.",
    "intro2": "Like the mobile application, it has been worked on in conjunction with the designer <a href='https://www.linkedin.com/in/magreyt/' target='_blank' style='text-decoration: underline;'>Magrey Touissainte</a>. Inspired mostly by the design of the application.",
    "intro3": "This system, in addition to having its mobile and desktop application, allows you to manage your patients' stories, as well as their information, schedule medical appointments and organize the days of the week. In addition, it has an automatic report generation, in which you only have to enter the forms and enter and select the corresponding values, and the system will generate an automatic report from the entered values. As well as, it has a section to generate recipes with medications and personalized instructions. Each of these generated files can be exported to PDF and printed. In addition, TraumApp has a section in which doctors after generating a patient report, this is automatically sent to the patient's email, with a summary of the appointment and the same generated file.",
    "patientIntro": "From this module, we can manage our patients, allowing us to add new patients, edit the patients that we have already entered, and be able to see their clinical record in detail, such as their personal information, medical records, and the prescriptions that the patient has. When searching for a patient, we can filter by all their attributes, as well as order the records. To keep this screen optimized, a limit of patients is shown, allowing the user to continue showing more patients if needed. On the other hand, when viewing the user file, the stories and recipes can be filtered by order or by name.",
    "calendarDsc": "In the calendar module we can have a view of our scheduled appointments as well as our past appointments. Allowing us to see in detail the appointments of each day and make a record of unsaved appointments or future appointments. This module allows you to schedule appointments and relate them to patients that we have already admitted, as well as add a short description of the appointment. Within the appointment file, we can send a notification to the user via WhatsApp informing him about the appointment. Also, we can change the status of the appointment, informing that the patient attended his consultation or that he could not attend. On the other hand, we can delete or edit the appointments that have been entered incorrectly.",
    "configDsc": "In the TraumApp configuration we have multiple functions, from viewing and editing our user data to adding medication and medical insurance records. We can also contact support from here allowing us to send an email in a simple way. In addition, we can configure what the Registration Mode is, adding the security PIN to exit the Registration Mode and we can also access this mode. Where we can carry out basic actions such as entering patients or confirming medical appointments. In case we are Premium users, we can export patient data and appointments to Excel. As well as enable the sending of automatic reports. On the other hand, we can activate or deactivate the Dark Mode, which only has a visual influence on the application.",
    "formDsc": "The reports section is the most complex, since from a simple form, I know how to create an automated medical report. In TraumApp there are different forms where each of them is different and in turn, the report they generate is different. In addition, these reports can be modified if necessary. On the other hand, the stories can be exported to PDF format or just saved in the system. If the user has the automatic report sending, this will automatically send the patient his medical report in case he needs it. On the other hand, the recipes are also generated automatically, the user only has to add the medications and the amount together with the indications and this will be generated, and like the reports, it can be exported to PDF or saved in the system.",
    "feature1": "Desktop App",
    "feature1dsc": "Apart from having a mobile and web version, this system also has a multiplatform desktop version. Developed with Electron and React, it allows you to carry out medical consultations without having to open the browser. Allowing, download different versions or for different systems.",
    "feature2": "Optimization of visual resources",
    "feature2dsc": "Each of the modules share visual elements, allowing that when making changes to the entire system, it is only necessary to make the change in one place. In addition, to optimize the load of very large lists, all the lists used in the system were virtualized to have fast and efficient response times.",
    "feature3": "Modularization",
    "feature3dsc": "For development, the visual sections such as the side menu, buttons, text boxes, lists and even the overview are components that can be adapted to the different needs of the screen where it is located, having the flexibility to adapt to any site with the details that we need",
    "feature4": "Dark mode",
    "feature4dsc": "Like the mobile version, two themes were designed, light and dark. This theme is shared with the application, that is, if your preference is dark mode in one application, it will be applied in the rest of the applications.",
    "feature5": "Responsive Design",
    "feature5dsc": "TraumApp was born as a mobile application, that is why its web version was developed under the Mobile First concept, since it wanted to have a great resemblance to its mobile version when entering from a mobile, that is why it is adaptable to any device and display. Keeping a nice flow as if you were in the app.",
    "colordsc": "TraumApp has a very varied color palette. With very striking colors and with a particular combination. These are the main or base colors on which the color palette is based. However, TraumApp has many derivatives of these colors to convey a different experience in each module."
  },
  "project": {
    "role": "Role:",
    "agency": "Agency:",
    "date": "Date:",
    "introTitle": "Introduction",
    "patientTitle": "Patient",
    "calendarTitle": "Calendar",
    "configTitle": "Configuration",
    "formTitle": "Forms",
    "visualRes": "Visual Result",
    "typo": "Typography",
    "color": "Color",
    "features": "Features",
    "thanks": "Thanks for Watching!",
    "hereMore": "Here you can know more ",
    "aboutLink": "about me",
    "otherWork": "You can see my other works!",
    "visitProject": "Visit",
    "desktopApp": "Watch"
  }
}
