{
  "traumappWeb": {
    "dsc": "Sistema para administración de consultas médicas",
    "role": "Creador/Fullstack",
    "intro1": "TraumApp es un sistema creado para agilizar consultas médicas. Permitiéndote administrar la información de pacientes, agendar citas médicas, crear informes automatizados, crear récipes con los medicamentos de tu preferencia, exportación a PDF y mucho más.",
    "intro2": "Al igual que la aplicación móvil, ha sido trabajada en conjunto con la diseñadora <a href='https://www.linkedin.com/in/magreyt/' target='_blank' style='text-decoration: underline;'>Magrey Touissainte</a>. Inspirado mayormente en el diseño de la aplicación.",
    "intro3": "Este sistema además de contar con su aplicación móvil y de escritorio, te permite gestionar las historias de tus pacientes, así como su información, agendar citas médicas y organizar los días de la semana. Además que cuenta con una generación de informes automática, en la cual solo debes ingresar en los formularios e ingresar y seleccionar los valores correspondientes, y el sistema generara un informe automático a partir de los valores ingresados. Así como también, cuenta con un apartado para generar récipes con medicamentos e indicaciones personalizadas. Cada uno de estos archivos generados, pueden ser exportados a PDF y ser impresos. Además, TraumApp cuenta con un apartado en el cual los médicos luego de generar un informe de un paciente, este se envía automáticamente al correo del paciente, con un resumen de la cita y el mismo archivo generado.",
    "patientIntro": "Desde este módulo, podemos administrar nuestros pacientes, permitiéndonos agregar nuevos pacientes, editar los pacientes que ya hemos ingresado, y poder ver a detalles su ficha clínica, como lo es su información personal, las historias médicas y los récipes que posee el paciente. A la hora de buscar paciente podemos filtrar por todos sus atributos, así como podemos ordenar también los registros. Para mantener esta pantalla optimizada se muestran un límite de pacientes permitiéndole al usuario seguir mostrando más pacientes en caso de que lo necesite. Por otra parte, al ver la ficha del usuario, las historias y récipes pueden ser filtrados por orden o nombre que posean.",
    "calendarDsc": "En el módulo de calendario podemos tener una visión de nuestras citas programadas así como nuestras citas pasadas. Permitiéndonos ver a detalle las citas de cada día y hacer registro de citas no guardadas o citas a futuro. Este módulo permite agendar citas y relacionarlas con pacientes que ya hayamos ingresado, así como también, agregar una pequeña descripción de la cita. Dentro de la ficha de la cita, podemos enviarle una notificación al usuario vía WhatsApp informándole acerca de la cita. También, podemos cambiar el status de la cita, informando que el paciente asistió a su consulta o que no pudo asistir. Por otra parte, podemos borrar o editar las citas que hayan sido ingresadas de manera incorrecta.",
    "configDsc": "En la configuración de TraumApp tenemos múltiples funciones, desde ver y editar los datos de nuestro usuario hasta agregar registros de medicamentos y seguros médicos. También podemos contactar a soporte desde aquí permitiéndonos enviar un correo de manera sencilla. Además, podemos configurar lo que es el Modo Registro, agregando el PIN de seguridad para salir del Modo Registro y también podemos acceder a este modo. Donde podemos realizar acciones básicas como ingresar pacientes o confirmar citas médicas. En caso de que seamos usuarios Premiun, podremos exportar los datos de los pacientes y las citas a Excel. Así como también habilitar él envió de informes automáticos. Por otra parte, podemos activar o desactivar el Modo Oscuro, el cual solo influye de manera visual en la aplicación.",
    "formDsc": "El apartado de informes es el más complejo, ya que a partir de un formulario sencillo, sé crear un informe médico automatizado. En TraumApp existen diferentes formularios donde cada uno de ellos es diferente y a su vez, es diferente el informe que estos generan. Además estos informes pueden ser modificados en caso de ser necesario. Por otra parte, las historias pueden ser exportadas a formato PDF o solo ser guardadas en el sistema. Si el usuario posee el envío de informe automático, esto hará que se le envíe de manera automática al paciente su informe médico en caso de que lo necesite. Por otro lado, los récipes también son generados de manera automática, el usuario solo debe agregar los medicamentos y la cantidad junto con las indicaciones y este será generado, y al igual que los informes, puede ser exportado a PDF o guardado en el sistema.",
    "feature1": "Versión Desktop",
    "feature1dsc": "Este sistema aparte de contar con su versión mobile y web, también cuenta con una versión desktop multiplataforma. Desarrollada con Electron y React, Permite llevar las consultas médicas sin necesidad de abrir el navegador. Permitiendo, descargar diferentes versiones o para diferentes sistemas.",
    "feature2": "Optimización de recursos visuales",
    "feature2dsc": "Cada uno de los módulos comparten elementos visuales, permitiendo que al momento de hacer cambios en todo el sistema, solo haga falta hacer el cambio en un solo sitio. Además, para optimizar la carga de listado muy grandes, se virtualizaron todas las listas usadas en el sistema para tener tiempos de respuestas rápidos y eficientes.",
    "feature3": "Modularización",
    "feature3dsc": "Para el desarrollo, los apartados visuales como el menú lateral, botones, cajas de texto, listas e incluso la vista general son componentes adaptables a las diferentes necesidades de la pantalla donde se encuentre, teniendo una flexibilidad para adaptarse a cualquier sitio con los detalles que necesitemos.",
    "feature4": "Modo Oscuro",
    "feature4dsc": "Al igual que la versión mobile, se diseñaron dos temas, el claro y el oscuro. Este tema es compartido con la aplicación, es decir, si tu preferencia es modo oscuro en una aplicación, se aplicara en el resto de aplicaciones.",
    "feature5": "Responsive Design",
    "feature5dsc": "TraumApp nació como una aplicación móvil, es por ello que su versión web se desarrolló bajo el concepto Mobile First, ya que se quería tener un gran parecido con su versión móvil al ingresar desde un móvil, es por ello que es adaptable a cualquier dispositivo y monitor. Manteniendo un flujo agradable como si te encontraras en la aplicación.",
    "colordsc": "TraumApp cuenta con una paleta de colores muy variada. Con colores muy llamativos y con una combinación particular. Estos son los colores principales o base en las que se basa la paleta de colores. Sin embargo, TraumApp cuenta con muchos derivados de estos colores para transmitir una experiencia distinta en cada módulo."
  },
  "project": {
    "role": "Rol:",
    "agency": "Empresa:",
    "date": "Fecha:",
    "introTitle": "Introducción",
    "patientTitle": "Paciente",
    "calendarTitle": "Calendario",
    "configTitle": "Configuración",
    "formTitle": "Formularios",
    "visualRes": "Resultado Visual",
    "typo": "Tipografía",
    "color": "Color",
    "features": "Características",
    "thanks": "Gracias por leer!",
    "hereMore": "Aquí puede saber más ",
    "aboutLink": "acerca de mí",
    "otherWork": "Puedes ver mis otros trabajos!",
    "visitProject": "Visitar",
    "desktopApp": "Ver"
  }
}
