{
  "resume": "It is an internal single page system (SPA). Created with Angular 8 and Java Spring, for document and discovery management at the Jacinto Convit Foundation. A website that has international standards and under the ISO 9001 standard.",
  "role": "Manager/Fullstack",
  "cmsresult": "CMS",
  "dsc": "Internal system for document management and findings processes",
  "intro": "The Fundación Jacinto Convit (FJC) is a non-profit institution that preserves, protects and continues the work, projects, values ​​and philosophy of the doctor, scientist and humanist Dr. Jacinto Convit.",
  "intro2": "Due to the large number of documents handled by the foundation, the main objective of the internal system that we achieved was to improve the management of large amounts of documents. Also, the foundation having the ISO 9001 license, must meet certain quality criteria, which is why the internal system has the management of these processes both for problem solving and for auditing them. The Fundacion Jacinto Convit has offices in Venezuela and the US, which is why the system was developed in two languages, English and Spanish.",
  "intro3": "For the CMS, an administration was created for each existing module in the application, as well as managing the users of the system and their activity in it. In this system controller all the data found in the modules can be monitored. As well as having a controller for the calls made to the database if necessary.",
  "intro4": "For the development of this CMS, a general template was used to visualize each module. While, for user management, there is a privilege system so that only predefined users can interact with specific modules.",
  "feature1title": "CMS",
  "feature1": "The system has a Content Management System to monitor the internal system, this has the possibility of viewing, creating, editing or deleting any type of information that the entered system has. Having in turn set aside to monitor user activities and limit them.",
  "feature2title": "High Performance",
  "feature2": "The system has great performance thanks to the use of Java Spring Boot, which allows managing cached information to improve loads. Also, its great speed is due to the simplicity of the information that is required for each process.",
  "feature3title": "Document Creation",
  "feature3": "The document management module allows users to create both Word and Excel documents, it also allows to save other types of files that are necessary. Templates can be uploaded from the CMS.",
  "feature4title": "Calendar with Alerts",
  "feature4": "The calendar was created to organize activities within the foundation, such as meetings or events, they also allow you to keep track of the tasks that must be done in the findings for their resolution.",
  "feature5title": "Multi-language",
  "feature5": "The system is in both English and Spanish, because the institution has different offices around the world, that is why this information must be contracted in both languages ​​for better use and a better user experience.",
  "project": {
    "role": "Role:",
    "agency": "Agency:",
    "date": "Date:",
    "introTitle": "Introduction",
    "visualRes": "Visual Result",
    "typoColor": "Typography - Color",
    "features": "Features",
    "thanks": "Thanks for Watching!",
    "hereMore": "Here you can know more ",
    "aboutLink": "about me",
    "otherWork": "You can see my other works!",
    "visitProject": "Visit"
  },
  "orm": {
    "resume": "It is a web page created with HTML5, CSS3, JS and PHP. a responsive website with a comfortable design to facilitate the user experience and high performance. Created to make it easier for Venezuelan schools to register for the Recreational Mathematics Olympics."
  },
  "myWeb": {
    "resume": "A website that is a Single-page application(SPA). With a high-performance, responsive website that uses powered animations. As also, uses the creative SVG's power for enriching user experience."
  },
  "afxtrade": {
    "resume": "It is a web application created with HTML5, CSS3, JS and PHP. A Venezuelan cryptocurrency exchange in which we can work with different cryptocurrencies such as BTC, USDT, PTR and more. With a comfortable interface allowing any user to use it. In addition, with a unique handling for each currency."
  },
  "copy": "© 2021, All rights reserved."
}
