{
  "traumappLanding": {
    "resume": "It is a web page developed with React. With a responsive web design for any device and simple animations for a better visual experience. Created as an information page for the TraumApp application with detailed documentation, membership purchase and user dashboard.",
    "dsc": "Landing page for TraumApp application and membership acquisition",
    "role": "Creator/Fullstack",
    "intro1": "TraumApp Landing is a web page for the TraumApp application in which you can find more information about the mobile application such as its characteristics, memberships, limits and detailed documentation in case of doubts about the use of the system. The page was designed in a responsive way, allowing it to be viewed from any device. As well as, it has different animations during navigation, which allows the user to have a more pleasant experience on their journey through the landing page.",
    "intro2": "This landing as well as the design of the application was made by the designer <b><a href='https://www.linkedin.com/in/magreyt/' target='_blank'> Magrey Tousaintte </a></b>.",
    "intro3": "Within this landing, TraumApp users can see their account details as well as acquire a membership through Paypal or Bitcoin. In addition, they can contact the support team through a form if required.",
    "titleDoc": "Documentation",
    "dscDoc1": "In the website you will find complete documentation on how to use the TraumApp application and each of its functions in detail.",
    "dscDoc2": "This documentation is designed to know in detail each of the modules within TraumApp from how to manage patients, schedule appointments, create reports, Record Mode and many more functions.",
    "titleMembership": "Memberships",
    "membershipDsc1": "TraumApp has different memberships, which the user can acquire one from the Landing through Paypal or Bitcoin. As well as, see the status of your current membership and download the invoice for this membership or any other that you have previously acquired.",
    "membershipDsc2": "In the case of Paypal, TraumApp Landing has an integration by both the Frontend and the Backend side for greater security.",
    "membershipDsc3": "In the case of Bitcoin, the payment by mail must be reported along with a capture to activate the membership.",
    "featureTitle1": "Responsive Design",
    "featureDsc1": "The design of TraumApp was made in detail for use on various devices but especially in the mobile environment, due to the nature of the application. That is why for its development a complete design of both versions of the page was made so that it was responsive on any screen",
    "featureTitle2": "High Performance",
    "featureDsc2": "In order for the page to perform well under any situation, various standards were used in development to keep the code clean and readable. In addition, different compression methods both at the time of compiling the project, as well as on the server side",
    "featureTitle3": "Material UI",
    "featureDsc3": "For the development of some sections, the Material UI library was used to improve the visual experience and development, used more than anything else for the forms within the landing. As well as the sidebar that the documentation has.",
    "featureTitle4": "Membership payment",
    "featureDsc4": "TraumApp Landing is where users can purchase their memberships through Paypal or Bitcoin. Where the integration through Paypal has server-side validation. Whereas, with Bitcoin, a manual process must be carried out for the payment notification.",
    "featureTitle5": "SVG",
    "featureDsc5": "There are different illustrations throughout the page that help make the experience pleasant, so that these illustrations were not too heavy and would retain their quality at any size, they were defined in SVG for better performance.",
    "featureTitle6": "CI/CD",
    "featureDsc6": "To improve development, CI / CD was implemented through Github Actions so as not to spend time deploying the changes on the server and automating this task."
  },
  "project": {
    "role": "Role:",
    "agency": "Agency:",
    "date": "Date:",
    "introTitle": "Introduction",
    "visualRes": "Visual Result",
    "typoColor": "Typography - Color",
    "features": "Features",
    "thanks": "Thanks for Watching!",
    "hereMore": "Here you can know more ",
    "aboutLink": "about me",
    "otherWork": "You can see my other works!",
    "visitProject": "Visit"
  }
}
