{
  "traumappLanding": {
    "resume": "Es una página web desarrollada con React. Con un diseño web responsivo para cualquier dispositivo y animaciones sencillas para una mejor experiencia visual. Creada como página informativa de la aplicación TraumApp con una documentación detallada, compra de membresías y dashboard para el usuario.",
    "dsc": "Landing page para aplicación TraumApp y adquisición de membresías",
    "role": "Creador/Fullstack",
    "intro1": "TraumApp Landing es una página web para la aplicación TraumApp en la cual se encuentra más información acerca de la aplicación móvil como sus características, membresías, limites y una documentación detallada en caso de dudas acerca del uso del sistema. La página fue diseñada de manera responsiva, permitiendo que pueda ser vista desde cualquier dispositivo. Así como también, cuenta con diferentes animaciones durante la navegación, que permite que el usuario tenga una experiencia más agradable en su recorrido por el landing page.",
    "intro2": "Este landing al igual que el diseño de la aplicación fue hecho por la diseñadora <b><a href='https://www.linkedin.com/in/magreyt/' target='_blank'>Magrey Tousaintte</a></b>.",
    "intro3": "Dentro de este landing los usuarios de TraumApp pueden ver detalles de su cuenta así como también adquirir una membresía por medio de Paypal o Bitcoin. Además, pueden contactar al equipo de soporte por medio de un formulario en caso de ser requerirlo.",
    "titleDoc": "Documentación",
    "dscDoc1": "Dentro del sitio web encontraras una documentación completa de como usar la aplicación de TraumApp y cada una de sus funciones detalladamente.",
    "dscDoc2": "Esta documentación esta diseñada para conocer de manera detallada cada uno de los módulos dentro de TraumApp desde como gestionar los pacientes, agendar citas, crear informes, Modo Registro y muchas más funciones.",
    "titleMembership": "Membresías",
    "membershipDsc1": "TraumApp cuenta con diferentes membresías, las cuales el usuario puede adquirir una desde al Landing por medio de Paypal o Bitcoin. Así como también, ver el estado de su membresía actual y descargar la factura de esta membresía o de cualquier otra que haya adquirido anteriormente.",
    "membershipDsc2": "En el caso de Paypal, TraumApp Landing cuenta con una integración tanto por parte de Frontend como del lado de Backend para mayor seguridad.",
    "membershipDsc3": "En el caso de Bitcoin, Se debe reportar el pago por medio de correo junto con un capture para activar la membresía.",
    "featureTitle1": "Responsive Design",
    "featureDsc1": "El diseño de TraumApp fue hecho detalladamente para su uso en varios dispositivos pero sobre todo en el ambiente móvil, debido a la naturaleza de la aplicación. Es por ello que para su desarrollo se hizo un diseñado completo de ambas versiones de la página para que este fuera responsivo en cualquier pantalla.",
    "featureTitle2": "Alto Rendimiento",
    "featureDsc2": "Para que la página contara con un buen rendimiento bajo cualquier situación, se usaron varios estándares en el desarrollo para mantener un código limpio y legible. Ademas, de diferentes métodos de compresión tanto al momento de compilar el proyecto, así como también del lado del servidor.",
    "featureTitle3": "Material UI",
    "featureDsc3": "Para el desarrollo de algunas secciones se utilizo la librería Material UI para mejorar la experiencia visual y el desarrollo, Utilizado más que nada para los formularios dentro del landing. Así como también el sidebar con el que cuenta la documentación.",
    "featureTitle4": "Pago de Membresías",
    "featureDsc4": "TraumApp Landing es donde los usuarios pueden adquirir sus membresías por medio de Paypal o Bitcoin. En donde la integración por medio de Paypal cuenta con validación del lado del servidor. Mientras que, con Bitcoin se debe realizar un proceso manual para la notificación de pago.",
    "featureTitle5": "SVG",
    "featureDsc5": "Se cuentan con diferentes ilustraciones en toda la página que ayudan a que la experiencia sea agradable, para que estas ilustraciones no fueran muy pesadas y conservaran su calidad en cualquier tamaño, se definieron en SVG para un mejor rendimiento.",
    "featureTitle6": "CI/CD",
    "featureDsc6": "Para mejorar el desarrollo se implemento CI/CD por medio de Github Actions para no pasar tiempo haciendo deployment de los cambios en el servidor y automatizar esta tarea."
  },
  "project": {
    "role": "Rol:",
    "agency": "Empresa:",
    "date": "Fecha:",
    "introTitle": "Introducción",
    "visualRes": "Resultado Visual",
    "typoColor": "Tipografía - Color",
    "features": "Características",
    "thanks": "Gracias por leer!",
    "hereMore": "Aquí puede saber más ",
    "aboutLink": "acerca de mí",
    "otherWork": "Puedes ver mis otros trabajos!",
    "visitProject": "Visitar"
  }
}
